Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: You likely called a function using the Python keyword `{keyword}` as an argument: a_function({keyword}=something) which Python interpreted as trying to assign a value to a Python keyword.
es: Es probable que hayas llamado a una función utilizando la palabra clave de Python `{keyword}` como argumento: una_function({keyword}=algo) que Python interpretó como un intento de asignar un valor a una palabra clave de Python.

source: You likely called a function with a named argument: a_function(invalid=something) where `invalid` is not a valid variable name in Python either because it starts with a number, or is a string, or contains a period, etc.
es: Es probable que hayas llamado a una función con un argumento con nombre: unaa_función(inválido=algo) donde `inválido` no es un nombre de variable válido en Python ya sea porque comienza con un número, o es una cadena o contiene un punto, etc.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you forgot to write a value after a colon.
es: Parece que el error se produjo mientras escribías un dict de Python. Tal vez se olvidó de escribir un valor después de dos puntos.

source: You have written an f-string whose content `{...}` includes a backslash; this is not allowed. Perhaps you can replace the part that contains a backslash by some variable. For example, suppose that you have an f-string like: f"{... 'hello\n' ...}" you could write this as hello = 'hello\n' f"{... hello ...}"
es: Ha escrito una f-string cuyo contenido `{...}` incluye una barra invertida; esto no está permitido. Tal vez pueda sustituir la parte que contiene una barra invertida por alguna variable. Por ejemplo, suponga que tiene una f-string como: f"{... 'hola\n' ...}" podría escribirla como hola = 'hola\n' f"{... hola ...}"

source: You have written an f-string which has an unmatched `}`. If you want to print a single `}`, you need to write `}}` in the f-string; otherwise, you need to add an opening `{`.
es: Has escrito una f-string que tiene un `}` sin emparejar. Si quieres imprimir un solo `}`, tienes que escribir `}}` en la f-string; de lo contrario, es necesario añadir una apertura `{`.

source: You have written an f-string which has an unmatched `{`. If you want to print a single `{`, you need to write `{{` in the f-string; otherwise, you need to add a closing `}`.
es: Has escrito una f-string que tiene un `{` sin emparejar. Si quieres imprimir un solo `{`, tienes que escribir `{{` en la f-string; de lo contrario, es necesario añadir un cierre `}`.

source: I am guessing that you were writing a comprehension or a generator expression and forgot to include parentheses around tuples. As an example, instead of writing [i, i**2 for i in range(10)] you would need to write [(i, i**2) for i in range(10)]
es: Supongo que estabas escribiendo una expresión de comprensión o un generador y olvidaste incluir paréntesis alrededor de las tuplas. Como ejemplo, en lugar de escribir [i, i**2 for i in range(10)] tendrías que escribir [(i, i**2) for i in range(10)]

source: A `from __future__ import` statement changes the way Python interprets the code in a file. It must appear at the beginning of the file.
es: Una sentencia `from __future__ import` cambia la forma en que Python interpreta el código de un archivo. Debe aparecer al principio del archivo.

source: The available features are `{names}`.
es: Las características disponibles son `{names}`.

source: When using a `from __future__ import` statement, you must import specific named features.
es: Cuando se utiliza una sentencia `from __future__ import`, debe importar características específicas por su nombre.

source: Instead of `{feature}`, perhaps you meant to import `{name}`.
es: En lugar de `{feature}`, tal vez querías importar `{name}`.

source: `{feature}` is not a valid feature of module `__future__`.
es: `{feature}` no es una característica válida del módulo `__future__`.

source: You are using a generator expression, something of the form x for x in thing You must add parentheses enclosing that expression.
es: Estás usando una expresión generadora, algo de la forma x for x in cosa Debes añadir paréntesis encerrando esa expresión.

source: I suspect you wrote `from __future__ import braces` following someone else's suggestion. This will never work. Unlike other programming languages, Python's code block are defined by their indentation level, and not by using some curly braces, like `{...}`.
es: Sospecho que has escrito `de __future__ import braces` siguiendo la sugerencia de otra persona. Esto nunca funcionará. A diferencia de otros lenguajes de programación, los bloques de código de Python se definen por su nivel de indentación, y no por el uso de algunas llaves, como `{...}`.

source: Did you use copy-paste?
es: ¿Usaste copiar y pegar?

source: Python indicates that you used the unicode character `{bad_character}` which is not allowed.
es: Python indica que has utilizado el carácter unicode `{bad_character}` que no está permitido.

source: Python tells us that you have written an invalid number.
es: Python nos dice que has escrito un número no válido.

source: However, I think that the problem might be the following.
es: Sin embargo, creo que el problema puede ser el siguiente.

source: I have no suggestion to offer to fix this problem.
es: No tengo una sugerencia para arreglar este problema.

source: The double star operator `**` is likely interpreted to mean that dict unpacking is to be used which is not allowed or does not make sense here.
es: El operador de doble estrella `**` probablemente se interpreta como que que se va a utilizar el desempaquetado del dictado, lo cual no está permitido o no tiene sentido en este caso.

source: You cannot use the `*` operator to unpack the iteration variable in a comprehension.
es: No se puede utilizar el operador `*` para descomponer la variable de iteración en una comprensión.

source: The following statement has no syntax error: {statement}
es: La siguiente declaración no tiene ningún error de sintaxis: {statement}

source: You have called a function repeating the same keyword argument (`{arg}`). Each keyword argument should appear only once in a function call.
es: Ha llamado a una función repitiendo el mismo argumento de palabra clave (`{arg}`). Cada argumento de palabra clave debe aparecer sólo una vez en una llamada a una función.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}` on line {lineno}.
es: Python nos dice que el cierre `{closing}` de la última línea mostrada no coincide con la apertura `{opening}` de la línea {lineno}.

source: Python tells us that the closing `{closing}` on the last line shown does not match the opening `{opening}`.
es: Python nos dice que el cierre `{closing}` de la última línea mostrada no coincide con la apertura `{opening}`.

source: Did you forget something after `*`?
es: ¿Olvidaste algo después de `*`?

source: Assuming you were defining a function, you need to replace `*` by either `*arguments` or by `*, named_argument=value`.
es: Asumiendo que estabas definiendo una función, necesitas sustituir `*` por `*argumentos` o por `*, argumento_nombrado=valor`.

source: You assigned a value to the variable `{name}` before declaring it as a global variable.
es: Usted asignó un valor a la variable `{name}`. antes de declararla como variable global.

source: Did you forget to add `nonlocal`?
es: ¿Olvidó añadir `nonlocal`?

source: You assigned a value to the variable `{name}` before declaring it as a nonlocal variable.
es: Ha asignado un valor a la variable `{name}` antes de declararla como variable no local.

source: You are including the statement {newline} indicating that `{name}` is a variable defined outside a function. You are also using the same `{name}` as an argument for that function, thus indicating that it should be variable known only inside that function, which is the contrary of what `global` implied.
es: Usted está incluyendo la declaración {newline} indicando que `{name}` es una variable definida fuera de una función. También está utilizando el mismo `{name}` como argumento para esa función, indicando así que debe ser una variable conocida sólo dentro de esa función, que es lo contrario de lo que implica `global`.

source: You used `{name}` as a parameter for a function before declaring it also as a nonlocal variable: `{name}` cannot be both at the same time.
es: Ha utilizado `{name}` como parámetro de una función antes de declararla también como variable no local: {name}` no puede ser ambas cosas a la vez.

source: You used the variable `{name}` before declaring it as a global variable.
es: Ha utilizado la variable `{name}` antes de declararla como variable global.

source: Did you forget to write `nonlocal` first?
es: ¿Olvidó escribir primero `nonlocal`?

source: You used the variable `{name}` before declaring it as a nonlocal variable.
es: Ha utilizado la variable `{name}` antes de declararla como variable no local.

source: You declared the variable `{name}` as being a nonlocal variable but it cannot be found.
es: Ha declarado la variable `{name}` como una variable variable no local, pero no se puede encontrar.

source: You used the nonlocal keyword at a module level. The nonlocal keyword refers to a variable inside a function given a value outside that function.
es: Ha utilizado la palabra clave nonlocal a nivel de módulo. La palabra clave nonlocal se refiere a una variable dentro de una función con un valor fuera de esa función.

source: In Python, you can define functions with only positional arguments def test(a, b, c): ... or only keyword arguments def test(a=1, b=2, c=3): ... or a combination of the two def test(a, b, c=3): ... but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
es: En Python, puedes definir funciones con sólo argumentos posicionales def prueba(a, b, c): ... o sólo con argumentos de palabra clave def prueba(a=1, b=2, c=3): ... o una combinación de ambos def prueba(a, b, c=3): ... pero con los argumentos de palabra clave apareciendo después de todos los posicionales. Según Python, has utilizado argumentos posicionales después de los de palabra clave.

source: I am guessing that you wanted to use an `except` statement with multiple exception types. If that is the case, you must surround them with parentheses.
es: Supongo que querías usar una sentencia `except` con múltiples tipos de excepción. Si ese es el caso, debes rodearlas con paréntesis.

source: In Python, you can call functions with only positional arguments test(1, 2, 3) or only keyword arguments test(a=1, b=2, c=3) or a combination of the two test(1, 2, c=3) but with the keyword arguments appearing after all the positional ones. According to Python, you used positional arguments after keyword ones.
es: En Python, pueden llamar a las funciones solo con argumentos posicionales prueba(1, 2, 3) o sólo con argumentos de palabra clave prueba(a=1, b=2, c=3) o una combinación de ambos prueba(1, 2, c=3) pero con los argumentos de palabra clave que aparecen después de los posicionales. Según Python, has utilizado argumentos posicionales después de los de palabra clave.

source: Perhaps you need to type print({message}) In older version of Python, `print` was a keyword. Now, `print` is a function; you need to use parentheses to call it.
es: Tal vez tenga que escribir print({message}) En la versión anterior de Python, `print` era una palabra clave. Ahora, `print` es una función por lo que es necesario usar paréntesis para llamarla.

source: Note that arguments of `print` must be separated by commas.
es: Tenga en cuenta que los argumentos de `print` deben estar separados por comas.

source: Did you mean `print({message})`?
es: ¿Quieres decir `print({message})`?

source: You can only use a `return` statement inside a function or method.
es: Sólo se puede utilizar una sentencia `return` dentro de una función o método.

source: A star assignment must be of the form: ... *name = list_or_tuple
es: Una asignación estrella debe ser de la forma: ... *nombre = lista_o_tupla

source: It looks like you tried to use a starred expression as a dict value; this is not allowed.
es: Parece que has intentado utilizar una expresión con asteriscos como valor de dict; esto no está permitido.

source: Your code is too complex for Python: you need to reduce the number of indented code blocks contained inside other code blocks.
es: Tu código es demasiado complejo para Python: necesitas reducir el número de bloques de código con sangría contenidos dentro de otros bloques de código.

source: Your code is too complex for Python: you need to reduce the number of parentheses contained inside other parentheses.
es: Tu código es demasiado complejo para Python: necesitas reducir el número de paréntesis contenidos dentro de otros paréntesis.

source: Python indicates that you need to surround an expression ending with a comma by parentheses.
es: Python indica que hay que rodear una expresión que termina con una coma por medio de paréntesis.

source: Perhaps you meant to write `{new_statement}`
es: Quizás quisiste escribir `{new_statement}`

source: However, I suspect that you wrote the keyword `{boolean}` by mistake.
es: Sin embargo, sospecho que has escrito la palabra clave `{boolean}` por error.

source: The Python keyword `{boolean}` can only be used for boolean expressions.
es: La palabra clave de Python `{boolean}` sólo puede utilizarse para expresiones booleanas.

source: However, if you remove the last comma, there will be no syntax error.
es: Sin embargo, si eliminas la última coma, no habrá ningún error de sintaxis.

source: I have no additional suggestion to offer. Please feel free to report this case.
es: No tengo ninguna sugerencia adicional que ofrecer. Por favor, siéntase libre de reportar este caso.

source: You are using the continuation character `\` outside of a string, and it is followed by some other character(s).
es: Está utilizando el carácter de continuación `\` fuera de una cadena y es seguido por algún otro carácter(es).

source: I am guessing that you wanted to divide by the number {number} and wrote \ instead of /.
es: Supongo que querías dividir por el número {number} y escribió \ en lugar de /.

source: Did you mean to divide by {number}?
es: ¿Querías dividir por {number}?

source: I am guessing that you forgot to enclose some content in a string.
es: Supongo que has olvidado encerrar algún contenido en una cadena.

source: Python tells us that it reached the end of the file and expected more content.
es: Python nos dice que llegó al final del archivo y que esperaba más contenido.

source: I will attempt to be give a bit more information.
es: Intentaré dar un poco más de información.

source: I suspect that you wrote a string that contains one backslash character, `\` followed by an uppercase `U` and some more characters. Python likely interpreted this as indicating the beginning of what is known as an escape sequence for special unicode characters. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the string, or replace `\U`, by `\\U`.
es: Sospecho que has escrito una cadena que contiene un carácter de barra invertida, `\` seguida de una `U` mayúscula y algunos caracteres más. Python probablemente interpretó esto como el comienzo de lo que se conoce como una secuencia de escape para caracteres especiales unicode. Para resolver el problema, escriba la llamada 'cadena cruda' añadiendo la letra `r` como prefijo en delante de la cadena, o reemplazar `\U`, por `\\U`.

source: The closing {bracket} on line {linenumber} does not match anything.
es: El {bracket} de cierre de la línea {linenumber} no coincide con nada.

source: Perhaps you forgot a closing quote.
es: Tal vez olvidó una comilla de cierre.

source: Inside the f-string `{fstring}`, you have another string, which starts with either a single quote (') or double quote ("), without a matching closing one.
es: Dentro de la f-string `{fstring}`, tiene otra cadena, que comienza con una comillas simples (') o comillas dobles ("), sin una comilla de cierre que coincida.

source: You can only use a `yield` statement inside a function.
es: Sólo se puede utilizar una sentencia `yield` dentro de una función.

source: This is a message that was added in Python 3.9 to prevent redefining `__peg_parser__`. It should not be present in other versions.
es: Este es un mensaje que se añadió en Python 3.9 para evitar la redefinición de `__peg_parser__`. No debería estar presente en otras versiones.

source: The closing {bracket} on line {close_lineno} does not match the opening {open_bracket} on line {open_lineno}.
es: El {bracket} de cierre de la línea {close_lineno} no coincide con el {open_bracket} de apertura de la línea {open_lineno}.

source: Did you mean to write `...`?
es: ¿Querías escribir `...`?

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `>>>`, should not be included in your code.
es: Parece que has copiado y pegado código de un intérprete interactivo. El prompt de Python, `>>>`, no debería estar incluido en tu código.

source: It looks like you copy-pasted code from an interactive interpreter. The Python prompt, `...`, should not be included in your code.
es: Parece que has copiado y pegado código de un intérprete interactivo. El prompt de Python, `...`, no debería estar incluido en tu código.

source: You should not use the backquote character.
es: No debe utilizar el carácter de retrocomilla.

source: You are using the backquote character. Either you meant to write a single quote, ', or copied Python 2 code; in this latter case, use the function `repr(x)`.
es: Estás utilizando el carácter de comillas. O bien has querido escribir una comilla simple, ', o has copiado el código de Python 2; en este último caso, utiliza la función `repr(x)`.

source: You forgot to add a condition.
es: Has olvidado añadir una condición.

source: An `if` statement requires a condition: if condition: ...
es: Una declaración `if` requiere una condición: if condición: ...

source: A `while` loop requires a condition: while condition: ...
es: Un bucle `while` requiere una condición: while condición: ...

source: A `for` loop requires at least 3 more terms.
es: Un bucle `for` requiere al menos 3 términos más.

source: A `for` loop is an iteration over a sequence: for element in sequence: ...
es: Un bucle `for` es una iteración sobre una secuencia: for elemento in secuencia: ...

source: A class needs a name.
es: Una clase necesita un nombre.

source: A `class` statement requires a name: class SomeName: ...
es: Una declaración `class` requiere un nombre: class AlgunNombre: ...

source: You cannot use the Python keyword `{word}` as an attribute.
es: No se puede utilizar la palabra clave de Python `{word}` como atributo.

source: `{word}` cannot be used as an attribute.
es: `{word}` no puede utilizarse como atributo.

source: Perhaps you meant to write `elif`.
es: Tal vez querías escribir `elif`.

source: You likely meant to use Python's `elif` keyword but wrote `{name}` instead.
es: Probablemente querías usar la palabra clave `elif` de Python pero en su lugar escribiste `{name}`.

source: Did you mean `from {module} import {function}`?
es: ¿Quieres decir `from {module} import {function}`?

source: You wrote something like import {function} from {module} instead of from {module} import {function}
es: Has escrito algo como import {function} from {module} en lugar de from {module} import {function}

source: The augmented assignment operator is not allowed in Python version {version}.
es: El operador de asignación aumentada no está permitido en la versión {version} de Python.

source: You appear to be using the operator `:=`, sometimes called the walrus operator. This operator requires the use of Python 3.8 or newer. You are using version {version}.
es: Parece que estás utilizando el operador `:=`, a veces llamado el operador morsa. Este operador requiere el uso de Python 3.8 o más reciente. Estás utilizando la versión {version}.

source: Did you write operators in an incorrect order?
es: ¿Has escrito los operadores en un orden incorrecto?

source: It looks like you wrote two operators (`{first}` and `{second}`) in the wrong order: `{wrong}` instead of `{correct}`.
es: Parece que has escrito dos operadores (`{first}` y `{second}`) en el orden equivocado: `{wrong}` en lugar de `{correct}`.

source: You wrote three equal signs in a row which is allowed in some programming languages, but not in Python. To check if two objects are equal, use two equal signs, `==`; to see if two names represent the exact same object, use the operator `is`.
es: Has escrito tres signos de igualdad seguidos, lo que está permitido en algunos lenguajes de programación, pero no en Python. Para comprobar si dos objetos son iguales, usa dos signos de igualdad, `==`; para ver si dos nombres representan exactamente el mismo objeto, utiliza el operador `is`.

source: Did you mean to use `is` instead of `===`?
es: ¿Querías usar `is` en lugar de `===`?

source: You cannot have write the same operator, `{op}`, twice in a row. Perhaps you wrote one of them by mistake or forgot to write something between them.
es: No se puede escribir el mismo operador, `{op}`, dos veces seguidas. Tal vez usted escribió uno de ellos por error o se olvidó de escribir algo entre ellos.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. It looks like you tried to use a starred expression as a dict value; this is not allowed.
es: No puedes tener estos dos operadores, `{first}` y `{second}`, siguiéndose el uno al otro. Parece que usted trató de usar una expresión estelar como un valor de dict; esto no está permitido.

source: You cannot have these two operators, `{first}` and `{second}`, following each other. Perhaps you wrote one of them by mistake or forgot to write something between them.
es: No puedes tener estos dos operadores, `{first}` y `{second}`, siguiéndose el uno al otro. Tal vez usted escribió uno de ellos por error o se olvidó de escribir algo entre ellos.

source: Or perhaps you included a space by mistake between the two operators and meant to write `{oper}` as a single operator.
es: O quizás incluyó un espacio por error entre los dos operadores y quiso escribir `{oper}` como un solo operador.

source: Did you mean to use `=`?
es: ¿Querías usar `=`?

source: You use the augmented assignment operator `:=` where the normal assignment operator `=` was required.
es: Se utiliza el operador de asignación aumentado `:=` donde el operador de asignación normal `=` era necesario.

source: The following statement would not contain a syntax error: {new_statement}
es: La siguiente sentencia no contendría un error de sintaxis: {new_statement}

source: Perhaps you needed `==` or `:=` instead of `=`.
es: Tal vez necesitabas `==` o `:=` en lugar de `=`.

source: You used an assignment operator `=`; perhaps you meant to use an equality operator, `==`, or the walrus operator `:=`.
es: Has utilizado un operador de asignación `=`; quizás querías utilizar un operador de igualdad, `==`, o el operador de asignación aumentado `:=`.

source: It looks as if you are attempting to use pip to install a module. `pip` is a command that needs to run in a terminal, not from a Python interpreter.
es: Parece que está intentando utilizar pip para instalar un módulo. `pip` es un comando que debe ejecutarse en una terminal, no desde un intérprete de Python.

source: Pip cannot be used in a Python interpreter.
es: Pip no puede ser utilizado en un intérprete de Python.
