Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: Note that object `{obj}` uses `__slots__` which prevents the creation of new attributes.
es: Tenga en cuenta que el objeto `{obj}` utiliza `__slots__` que impide la creación de nuevos atributos.

source: The following are some of its known attributes: `{names}`.
es: A continuación se detallan algunos de sus atributos conocidos: `{names}`.

source: The object `{obj_name}` has no attribute named `{attribute}`.
es: El objeto `{obj_name}` no tiene ningún atributo llamado `{attribute}`.

source: Perhaps you meant to write `{obj}.{correct}` instead of `{obj}.{typo}`
es: Tal vez quiso escribir `{obj}.{correct}` en lugar de `{obj}.{typo}`

source: Did you mean one of the following: `{names}`?
es: ¿Te refieres a uno de los siguientes: `{names}`?

source: Instead of writing `{obj}.{typo}`, perhaps you meant to write one of the following names which are attributes of object `{obj}`: `{names}`
es: En lugar de escribir `{obj}.{typo}`, tal vez quiso escribir uno de los siguientes nombres que son atributos del objeto `{obj}`: `{names}`

source: Did you write a comma by mistake?
es: ¿Escribiste una coma por error?

source: `{obj_name}` is a tuple that contains a single item which does have `'{attribute}'` as an attribute. Perhaps you added a trailing comma by mistake at the end of the line where you defined `{obj_name}`.
es: `{obj_name}` es una tupla que contiene un único elemento que tiene `{attribute}` como atributo. Tal vez haya añadido por error una coma al final de la línea donde definiste `{obj_name}`.

source: Did you mean `{str_content}.join({obj_name})`?
es: ¿Te refieres a `{str_content}.join({obj_name})`?

source: The object `{obj_name}` has no attribute named `join`. Perhaps you wanted something like `{str_content}.join({obj_name})`.
es: El objeto `{obj_name}` no tiene un atributo llamado `join`. Tal vez querías algo como `{str_content}.join({obj_name})`.

source: Did you mean `{known_builtin}({obj_name})`?
es: ¿Te refieres a `{known_builtin}({obj_name})`?

source: The object `{obj_name}` has no attribute named `{attribute}`. Perhaps you can use the Python builtin function `{known_builtin}` instead: `{known_builtin}({obj_name})`.
es: El objeto `{obj_name}` no tiene ningún atributo llamado `{attribute}`. Tal vez pueda utilizar la función incorporada de Python `{known_builtin}` en su lugar: `{known_builtin}({obj_name})`.

source: Did you mean `{attr}`?
es: ¿Quieres decir `{attr}`?

source: The object `{name}` has no attribute named `{attribute}`.
es: El objeto `{name}` no tiene ningún atributo llamado `{attribute}`.

source: However, `{attr}` is an attribute of `{name}` with a similar meaning.
es: Sin embargo, `{attr}` es un atributo de `{name}` con un significado similar.

source: However, `{name}` has the following attributes with similar meanings: `{attributes}`.
es: Sin embargo, `{name}` tiene los siguientes atributos con significados similares: `{attributes}`.

source: Did you mean to separate object names by a comma?
es: ¿Te refieres a separar los nombres de los objetos con una coma?

source: `{second}` is not an attribute of `{first}`. However, both `{first}` and `{second}` are known objects. Perhaps you wrote a period to separate these two objects, instead of using a comma.
es: `{second}` no es un atributo de `{first}`. Sin embargo, tanto `{first}` como `{second}` son objetos conocidos. Tal vez utilizaste un punto para separar estos dos objetos en lugar de usar una coma.

source: In your program, the name of the file that cannot be found is `{filename}`.
es: En su programa, el nombre del archivo que no se puede encontrar es `{filename}`.

source: {directory} is not a valid directory.
es: {directory} no es un directorio valido.

source: It was expected to be found in the `{directory}` directory.
es: Se esperaba encontrarlo en el directorio directorio `{directory}`.

source: Did you mean `{similar}`?
es: ¿Quieres decir `{similar}`?

source: The file `{similar}` has a similar name.
es: El archivo `{similar}` tiene un nombre similar.

source: Perhaps you meant one of the following files with similar names:
es: Tal vez se refiera a uno de los siguientes archivos con nombres similares:

source: I have no additional information for you.
es: No tengo información adicional para usted.

source: The object that could not be imported is `{name}`. The module or package where it was expected to be found is `{module}`.
es: El objeto que no se ha podido importar es `{name}`. El módulo o paquete donde se esperaba encontrar se esperaba encontrar es `{module}`.

source: Python indicated that you have a circular import. This can occur if executing the code in module 'A' results in executing the code in module 'B' where an attempt to import a name from module 'A' is made before the execution of the code in module 'A' had been completed.
es: Python ha indicado que tienes una importación circular. Esto puede ocurrir si al ejecutar el código en el módulo 'A' resulta en la ejecución del código en el módulo 'B' donde un intento de importar un nombre del módulo 'A' se hace antes de que la ejecución del código en el módulo 'A' haya finalizado.

source: Inconsistent state: `'{module}'` was apparently not imported. As a result, no further analysis can be done.
es: Estado inconsistente: `'{module}'` aparentemente no fue importado. Como resultado, no se puede realizar ningún otro análisis.

source: Perhaps you meant to import `{correct}` (from `{module}`) instead of `{typo}`
es: Tal vez quiso importar `{correct}` (de `{module}`) en lugar de `{typo}`

source: Instead of trying to import `{typo}` from `{module}`, perhaps you meant to import one of the following names which are found in module `{module}`: `{candidates}`
es: En lugar de intentar importar `{typo}` de `{module}`, tal vez lo que querías era importar uno de los siguientes nombres que se encuentran en el módulo `{module}`: `{candidates}`

source: The object that could not be imported is `{name}`.
es: El objeto que no se ha podido importar es `{name}`.

source: The problem was likely caused by what is known as a 'circular import'. First, Python imported and started executing the code in file '{file}'. which imports module `{last_module}`. During this process, the code in another file, '{last_file}' was executed. However in this last file, an attempt was made to import the original module `{last_module}` a second time, before Python had completed the first import.
es: El problema fue probablemente causado por lo que se conoce como una 'importación circular'. Primero, Python importó y comenzó a ejecutar el código en el archivo '{file}'. que importa al módulo `{last_module}`. Durante este proceso, el código en el otro archivo '{last_file}' fue ejecutado. Sin embargo, en este último archivo, se intentó de importar el módulo original `{last_module}` por segunda vez, antes de que Python hubiera completado la primera importación.

source: You have tried to assign a value to an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
es: Ha intentado asignar un valor a un elemento de un objeto de tipo `{obj_type}` que no puedo identificar. El índice que has dado no es un valor permitido.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} of length `{length}`.
es: Ha intentado asignar un valor al índice `{index}` de `{name}`, {obj_type} de longitud `{length}`.

source: The valid index values of `{name}` are integers ranging from `{min}` to `{max}`.
es: Los valores de índice válidos de `{name}` son números enteros que van desde `{min}` a `{max}`.

source: Remember: the first item of {obj_type} is not at index 1 but at index 0.
es: Recuerda: el primer elemento de {obj_type} no está en la posición 1 sino en la número 0.

source: `{name}` contains no item.
es: {name}`no contiene items.

source: You have tried to assign a value to index `{index}` of `{name}`, {obj_type} which contains no item.
es: Ha intentado asignar un valor al índice `{index}` de `{name}`, {obj_type} que no contiene ningún elemento.

source: You have tried to get an item of an object of type `{obj_type}` which I cannot identify. The index you gave was not an allowed value.
es: Ha intentado obtener un elemento de un objeto de tipo `{obj_type}` que no puedo identificar. El índice que has dado no es un valor permitido.

source: You have tried to get an item from `{name}`, {obj_type} of length `{length}`, by using a value for the index that I cannot determine but which is not allowed.
es: Ha intentado obtener un elemento de `{name}`, {obj_type} de longitud `{length}`, utilizando un valor para el índice que no puedo determinar pero que no está permitido.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} of length `{length}`.
es: Ha intentado obtener el elemento con índice `{index}` de `{name}`, {obj_type} de longitud `{length}`.

source: You have tried to get the item with index `{index}` of `{name}`, {obj_type} which contains no item.
es: Ha intentado obtener el elemento con índice `{index}` de `{name}`, {obj_type} que no contiene ningún elemento.

source: You tried to retrieve an item from an empty `dict` or a similar object which I cannot identify.
es: Has intentado recuperar un elemento de un `dict` vacío o un objeto similar que no he podido identificar.

source: `{name}` is an empty `dict`.
es: `{name}` es un `dict` vacío.

source: You tried to retrieve an item from `{name}` which is an empty `dict`.
es: Has intentado recuperar un elemento de {name}` que es un `dict` vacío.

source: You tried to retrieve an item from an empty ChainMap or similar object which I cannot identify.
es: Ha intentado recuperar un elemento de un ChainMap vacío o un objeto similar que no puedo identificar.

source: `{name}` is an empty `ChainMap`.
es: `{name}` es un `ChainMap` vacío.

source: You tried to retrieve an item from `{name}` which is an empty `ChainMap`.
es: Has intentado recuperar un elemento de `{name}` que es un `ChainMap` vacío.

source: Missing key `{key}` in a `ChainMap` or in a similar object.
es: Falta la clave `{key}` en un `ChainMap` o en un objeto similar.

source: A `dict` or a similar object which I cannot identify does not have `{key}` as a key.
es: Un `dict` o un objeto similar que no puedo identificar no tiene `{key}` como clave.

source: The key `{key}` cannot be found in the dict `{name}`.
es: La clave `{key}` no se encuentra en el dict `{name}`.

source: The key `{key}` cannot be found in `{name}`, an object of type `{obj_type}`.
es: La clave `{key}` no se encuentra en `{name}`, un objeto de tipo `{obj_type}`.

source: `{name}` contains a string key which is identical to `str({key})`. Perhaps you forgot to convert the key into a string.
es: `{name}` contiene una clave de cadena que es idéntica a `str({key})`. Tal vez te olvidaste de convertir la clave en una cadena.

source: Did you forget to convert `{key}` into a string?
es: ¿Olvidaste convertir `{key}` en una cadena?

source: `{key}` is a string. There is a key of `{name}` whose string representation is identical to `{key}`.
es: `{key}` es una cadena. Existe una clave de `{name}` cuya representación en cadena es idéntica a `{key}`.

source: Did you convert `{key}` into a string by mistake?
es: ¿Has convertido `{key}` en una cadena por error?

source: `{name}` is a key of `{dict_}` which is similar to `{key}`.
es: `{name}` es una clave de `{dict_}` que es similar a `{key}`.

source: `{name}` has some keys similar to `{key}` including: `{names}`.
es: `{name}` tiene algunas claves similares a `{key}` incluyendo: `{names}`.

source: No additional information available since `{name}` cannot be imported.
es: No hay información adicional disponible ya que `{name}` no se puede importar.

source: Did you mean `from {name} import {rest}`?
es: ¿Quieres decir `from {name} import {rest}`?

source: `{rest}` is not a separate module but an object that is part of `{name}`.
es: `{rest}` no es un módulo independiente, sino un objeto que forma parte de `{name}`.

source: Did you mean `import {name}.{attr}`?
es: ¿Quieres decir `import {name}.{attr}`?

source: Perhaps you meant `import {name}.{attr}`. `{attr}` is a name similar to `{rest}` and is a module that can be imported from `{name}`.
es: Tal vez se refiera a `importar {name}.{attr}`. `{attr}` es un nombre similar a `{rest}` y es un módulo que puede ser importado desde `{name}`.

source: Did you mean `from {name} import {attr}`?
es: ¿Quieres decir `from {name} import {attr}`?

source: Perhaps you meant `from {name} import {attr}`. `{attr}` is a name similar to `{rest}` and is an object that can be imported from `{name}`.
es: Tal vez quieras decir `from {name} import {attr}`. `{attr}` es un nombre similar a `{rest}` y es un objeto que puede ser importado desde `{name}`.

source: Other objects with similar names that are part of `{name}` include `{others}`.
es: Otros objetos con nombres similares que forman parte de `{name}` incluyen a `{others}`.

source: `{rest}` cannot be imported from `{name}`.
es: `{rest}` no puede ser importado desde `{name}`.

source: The curses module is rarely installed with Python on Windows.
es: El módulo curses rara vez se instala con Python en Windows.

source: The curses module is often not installed with Python.
es: El módulo curses no suele instalarse con Python.

source: You have tried to import the curses module.
es: Ha intentado importar el módulo curses.

source: No module named `{name}` can be imported. Perhaps you need to install it.
es: No se puede importar el módulo llamado `{name}`. Tal vez sea necesario instalarlo.

source: The following existing modules have names that are similar to the module you tried to import: `{names}`
es: Los siguientes módulos existentes tienen nombres similares al módulo que ha intentado importar: `{names}`

source: `{name}` is an existing module that has a similar name.
es: `{name}` es un módulo existente que tiene un nombre similar.

source: You are already using Python!
es: ¡Ya estás usando Python!

source: `{name}` is a name found in module `{mod}`. Perhaps you forgot to write from {mod} import {name}
es: `{name}` es un nombre que se encuentra en el módulo `{mod}`. Tal vez haya olvidado escribir from {mod} import {name}

source: `{name}` is a name found in the following modules from the standard library: {modules}. Perhaps you forgot to import `{name}` from one of these modules.
es: `{name}` es un nombre que se encuentra en los siguientes módulos de la biblioteca estándar: {modules}. Tal vez hayas olvidado importar `{name}` de uno de estos módulos.

source: In your program, `{var_name}` is an unknown name that exists in an enclosing scope, but has not yet been assigned a value.
es: En tu programa, `{var_name}` es un nombre desconocido que existe en un ámbito de aplicación pero aún no se le ha asignado un valor.

source: In your program, no object with the name `{var_name}` exists.
es: En su programa, no existe ningún objeto con el nombre `{var_name}`.

source: Did you use a colon instead of an equal sign?
es: ¿Ha utilizado dos puntos en lugar del signo de igualdad?

source: Did you mean `1j`?
es: ¿Quieres decir `1j`?

source: However, sometimes `{name}` is intended to represent the square root of `-1` which is written as `1j` in Python.
es: Sin embargo, a veces `{name}` pretende representar la raíz cuadrada de `-1` que se escribe como `1j` en Python.

source: Did you mean `{word}`?
es: ¿Quieres decir `{word}`?

source: I suspect you meant to write the keyword `{word}` and made a typo.
es: Sin embargo, sospecho que has escrito la palabra clave `{word}` por error.

source: `__debug__` is a constant.
es: `__debug__` es una constante.

source: `__debug__` is a constant that cannot be deleted. In future Python versions, attempting to delete it will be a SyntaxError.
es: `__debug__` es una constante que no puede ser borrada. En futuras versiones de Python, los intentos de borrarla elevaran un `SyntaxError`.

source: You must be a fan of PyConAu!
es: ¡Debes ser un fan de la PyConAu!

source: I am guessing that you tried to use (one of) the flipfloperators shown during the second Lightning Talk session of PyConAu 2018, but that you forgot to install the module from PyPI. #### Note that it is still a bad idea.
es: Supongo que has intentado utilizar (uno de) los flipfloperators mostrado durante la segunda sesión de Lightning Talk de PyConAu 2018, pero que olvidaste instalar el módulo desde PyPI. #### Ten en cuenta que sigue siendo una mala idea.

source: Did you forget to import `{name}`?
es: ¿Olvidaste importar `{name}`?

source: The name `{name}` is not defined in your program. Perhaps you forgot to import `{lowercase}` which is found in Python's standard library.
es: El nombre `{name}` no está definido en su programa. Tal vez se olvidó de importar `{lowercase}` que se encuentra en la biblioteca estándar de Python.

source: Note that the name of the module is `{lowercase}` and not `{name}`.
es: Tenga en cuenta que el nombre del módulo es `{lowercase}` y no `{name}`.

source: The similar name `{name}` was found in the local scope.
es: Se ha encontrado el nombre similar `{name}` en el ámbito local.

source: The similar name `{name}` was found in the global scope.
es: Se ha encontrado el nombre similar `{name}` en el ámbito global.

source: The Python builtin `{name}` has a similar name.
es: El builtin de Python `{name}` tiene un nombre similar.

source: Instead of writing `{name}`, perhaps you meant one of the following:
es: En lugar de escribir `{name}`, tal vez quiso decir uno de los siguientes:

source: * Local scope:
es: * alcance local:

source: * Global scope:
es: * alcance global:

source: * Python builtins:
es: * integrados de Python:

source: Did you write `self` at the wrong place?
es: ¿Escribiste `self` en el lugar equivocado?

source: The {scope} object `{obj}` has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}(...` instead of `{unknown_name}(self, ...`.
es: El objeto {scope} `{obj}` tiene un atributo llamado `{unknown_name}`. Quizás deberías haber escrito `self.{unknown_name}(...` en lugar de `{unknown_name}(self, ...`.

source: Did you forget to add `self.`?
es: ¿Has olvidado añadir `self.`?

source: A {scope} object, `{obj}`, has an attribute named `{unknown_name}`. Perhaps you should have written `self.{unknown_name}` instead of `{unknown_name}`.
es: Un objeto de {scope}, `{obj}`, tiene un atributo llamado `{unknown_name}`. Tal vez deberías haber escrito `self.{unknown_name}` en lugar de `{unknown_name}`.

source: Did you forget to add `{name}.`?
es: ¿Has olvidado añadir `{name}.`?

source: The {scope} object `{name}` has an attribute named `{unknown_name}`. Perhaps you should have written `{name}.{unknown_name}` instead of `{unknown_name}`.
es: El objeto {scope} `{name}` tiene un atributo llamado `{unknown_name}`. Quizás deberías haber escrito `{name}.{unknown_name}` en lugar de `{unknown_name}`.

source: I suspect that you are trying to connect to a server and that a connection cannot be made. If that is the case, check for typos in the URL and check your internet connectivity.
es: Sospecho que está intentando conectarse a un servidor y que no se puede realizar la conexión. Si ese es el caso, verifique que la URL sea correcta y compruebe su conectividad a Internet.

source: Perhaps you need to double the backslash characters.
es: Tal vez sea necesario duplicar las barras invertidas.

source: I suspect that you wrote a filename or path that contains at least one backslash character, `\`. Python likely interpreted this as indicating the beginning of what is known as an escape sequence. To solve the problem, either write a so-called 'raw string' by adding the letter `r` as a prefix in front of the filename or path, or replace all single backslash characters, `\`, by double ones: `\\`.
es: Sospecho que ha escrito un nombre de archivo o ruta que contiene por lo menos un carácter de barra invertida, `\`. Python probablemente interpretó esto como el comienzo de lo que se conoce como una secuencia de escape. Para resolver el problema, escriba la llamada 'cadena cruda' añadiendo la letra `r` como prefijo delante delante del nombre del archivo o de la ruta, o reemplazar todas las barras invertidas simples, "barra invertida", por otras dobles: `\\`.

source: Did you forget to convert the string `{name}` into {number_type}?
es: ¿Has olvidado convertir el string `{name}` al tipo {number_type}?

source: Perhaps you forgot to convert the string `{name}` into {number_type}.
es: Tal vez haya olvidado convertir la cadena `{name}` en {number_type}.

source: The second argument of the function `getattr()` must be a string.
es: El segundo argumento de la función `getattr()` debe ser una cadena.

source: The second argument of the function `hasattr()` must be a string.
es: El segundo argumento de la función `hasattr()` debe ser una cadena.

source: You tried to concatenate (add) two different types of objects: {first} and {second}.
es: Has intentado concatenar (sumar) dos tipos de objetos diferentes: `{first}` y `{second}`.

source: You tried to add two incompatible types of objects: {first} and {second}.
es: Has intentado añadir dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to subtract two incompatible types of objects: {first} and {second}.
es: Has intentado restar dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to multiply two incompatible types of objects: {first} and {second}.
es: Has intentado multiplicar dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to divide two incompatible types of objects: {first} and {second}.
es: Has intentado dividir dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to perform the bitwise operation {operator} on two incompatible types of objects: {first} and {second}.
es: Has intentado realizar la operación de bits {operator} sobre dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: Did you mean `{line}`?
es: ¿Quieres decir `{line}`?

source: Outside of Python, `^` is often used to indicate exponentiation.
es: Fuera de Python, `^` se utiliza a menudo para indicar la exponenciación.

source: Perhaps you meant `{line}`.
es: Tal vez quiso decir `{line}`.

source: You tried to perform the bit shifting operation {operator} on two incompatible types of objects: {first} and {second}.
es: Has intentado realizar la operación de desplazamiento de bits {operator} sobre dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to exponentiate (raise to a power) using two incompatible types of objects: {first} and {second}.
es: Has intentado exponer (elevar a una potencia) usando dos tipos de objetos incompatibles: `{first}` y `{second}`.

source: You tried to use the operator {operator} using two incompatible types of objects: {first} and {second}. This operator is normally used only for multiplication of matrices.
es: Has intentado utilizar el operador {operator} utilizando dos tipos de objetos incompatibles: `{first}` y `{second}`. Este operador se emplea normalmente sólo para la multiplicación de matrices.

source: Complex numbers cannot be ordered.
es: Los números complejos no se pueden ordenar.

source: You tried to do an order comparison ({operator}) between two complex numbers.
es: Has intentado hacer una comparación de orden ({operator}) entre dos números complejos.

source: You tried to do an order comparison ({operator}) between two incompatible types of objects: {first} and {second}.
es: Has intentado hacer una comparación de orden ({operator}) entre dos tipos de objetos incompatibles: `{first}` y `{second}`.
