Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: I am guessing that you are attempting to use Python to run a program. You must do so from a terminal and not from a Python interpreter.
es: Supongo que estás intentando utilizar Python para ejecutar un programa. Debe hacerlo desde un terminal y no desde un intérprete de Python.

source: You cannot have a dot `.` followed by `{bracket}`.
es: No puede haber un punto `.` seguido de `{bracket}`.

source: Perhaps you need to replace the dot by a comma.
es: Tal vez haya que sustituir el punto por una coma.

source: It looks like you are trying to raise an exception using Python 2 syntax.
es: Parece que estás intentando lanzar una excepción utilizando la sintaxis de Python 2.

source: Did you forget a colon `:`?
es: ¿Olvidaste los dos puntos `:`?

source: You wrote a `{for_while}` loop but forgot to add a colon `:` at the end
es: Has escrito un bucle `{for_while}` pero olvidó añadir dos puntos `:` al final

source: You wrote a statement beginning with `{name}` but forgot to add a colon `:` at the end.
es: Ha escrito una sentencia que empieza por {name}` pero se olvidó de añadir los dos puntos `:` al final.

source: You wrote a semicolon, `;`, where a comma was expected.
es: Has escrito un punto y coma, `;`, donde se esperaba una coma.

source: You wrote semicolons, `;`, where commas were expected.
es: Has escrito punto y coma, `;`, donde se esperaban comas.

source: Did you mean to write commas?
es: ¿Querías escribir comas?

source: You wrote a semicolon, `;`, where a colon was expected.
es: Has escrito un punto y coma, `;`, donde se esperaba dos puntos.

source: Did you mean to write a colon?
es: ¿Querías escribir dos puntos?

source: Did you made a mistake in writing an hexadecimal integer?
es: ¿Te has equivocado al escribir un entero hexadecimal?

source: It looks like you used an invalid character (`{character}`) in an hexadecimal number. Hexadecimal numbers are base 16 integers that use the symbols `0` to `9` to represent values 0 to 9, and the letters `a` to `f` (or `A` to `F`) to represent values 10 to 15. In Python, hexadecimal numbers start with either `0x` or `0X`, followed by the characters used to represent the value of that integer.
es: Parece que has utilizado un carácter no válido (`{character}`) en un número hexadecimal. Los números hexadecimales son enteros de base 16 que utilizan los símbolos `0` a `9` para representar los valores 0 a 9, y las letras `a` a `f` (o `A` a `F`) para representar los valores del 10 al 15. En Python, los números hexadecimales comienzan con `0x` o `0X`, seguido de los caracteres utilizados para representar el valor de ese número entero.

source: Did you made a mistake in writing an octal integer?
es: ¿Te has equivocado al escribir un entero octal?

source: It looks like you used an invalid character (`{character}`) in an octal number. Octal numbers are base 8 integers that only use the symbols `0` to `7` to represent values. In Python, octal numbers start with either `0o` or `0O`, (the digit zero followed by the letter `o`) followed by the characters used to represent the value of that integer.
es: Parece que has utilizado un carácter no válido (`{character}`) en un número octal. Los números octales son enteros de base 8 que sólo utilizan los símbolos `0` a `7` para representar valores. En Python, los números octales comienzan con `0o` o `0O`, (el dígito cero seguido de la letra `o`) seguido de los caracteres utilizados para representar el valor de ese número entero.

source: Valid names cannot begin with a number.
es: Los nombres válidos no pueden empezar por un número.

source: Did you mean `{number}j`?
es: ¿Quieres decir `{number}j`?

source: Perhaps you thought that `i` could be used to represent the square root of `-1`. In Python, the symbol used for this is `j` and the complex part is written as `some_number` immediately followed by `j`, with no spaces in between. Perhaps you meant to write `{number}j`.
es: Tal vez pensó que `i` podría ser utilizado para representar la raíz cuadrada de `-1`. En Python, el símbolo utilizado para esto es `j` y la parte compleja se escribe como `algún_número` inmediatamente seguido de `j`, sin espacios intermedios. Tal vez haya querido escribir `{number}j`.

source: [Note: `{first} * {second}` would also be valid since `{first}` is a complex number.]
es: [Nota: `{first}` * {second}` también sería válido ya que `{first}` es un número complejo].

source: Perhaps you forgot a multiplication operator, `{first} * {second}`.
es: Tal vez olvidó un operador de multiplicación, `{first} * {second}`.

source: Your Python version does not support this f-string feature.
es: Su versión de Python no soporta esta función f-string.

source: You are likely using a 'debug' syntax of f-strings introduced in Python version 3.8. You are using version {version}.
es: Es probable que estés usando una sintaxis de depuración de f-strings introducida en la versión 3.8 de Python. Estás usando la versión {version}.

source: You are likely trying to assign a value within an f-string. This is not allowed.
es: Es probable que esté intentando asignar un valor dentro de un f-string. Esto no está permitido.

source: The content of your f-string is invalid. Please consult the documentation: https://docs.python.org/3/reference/lexical_analysis.html#f-strings
es: El contenido de su f-string no es válido. Consulte la documentación: https://docs.python.org/3/reference/lexical_analysis.html#f-strings

source: Python keywords cannot be used as identifiers (variable names).
es: Las palabras clave de Python no pueden utilizarse como identificadores (nombres de variables).

source: `lambda` does not allow parentheses around its arguments. This was allowed in Python 2 but it not allowed in Python 3.
es: `lambda` no permite paréntesis alrededor de sus argumentos. Esto estaba permitido en Python 2 pero no en Python 3.

source: You cannot have explicit tuples as arguments. Assign any tuple to a parameter and unpack it within the body of the function.
es: No se pueden tener tuplas explícitas como argumentos. Asigne cualquier tupla a un parámetro y desempaque dentro del cuerpo de la función.

source: If you remove `{type_decl}`, you will have a valid Python statement.
es: Si eliminas `{type_decl}`, tendrás una declaración válida de Python.

source: However, even if you remove `{type_decl}`, there would still be some some syntax errors.
es: Sin embargo, incluso si se elimina `{type_decl}`, todavía habría algunos algunos errores de sintaxis.

source: You do not need to declare variables in Python.
es: No es necesario declarar variables en Python.

source: It looks like you were trying to declare that `{var}` was a variable using the word `{type_decl}`.
es: Parece que estabas intentando declarar que `{var}` era una variable utilizando la palabra `{type_decl}`.

source: I am guessing that you forgot a comma between two strings when defining a dict.
es: Supongo que has olvidado una coma entre dos cadenas al definir un dict.

source: Did you forget to write `in`?
es: ¿Olvidaste escribir `in`?

source: It looks as though you forgot to use the keyword `in` as part of a `for` statement. Perhaps you meant: {new_statement}
es: Parece que ha olvidado utilizar la palabra clave `in` como parte de una sentencia `for`. Tal vez quiso decir: {new_statement}

source: Did you forget to write parenthesis?
es: ¿Te has olvidado de escribir paréntesis?

source: It looks as though you forgot to use to use parenthesis with `range`. Perhaps you meant: {new_statement}
es: Parece que te has olvidado de usar paréntesis con `range`. Tal vez quisiste decir: {new_statement}

source: Perhaps you meant to write `{keyword}` and made a typo. The correct line might be `{line}`
es: Tal vez quiso escribir `{keyword}` y cometió un error. La línea correcta podría ser `{line}`

source: I am guessing that you were writing a comprehension or a generator expression and use the wrong order for a condition. The correct order depends if there is an `else` clause or not. For example, the correct order for a list comprehensions with condition can be either [f(x) if condition else other for x in sequence] # 'if' before 'for' or, if there is no `else` [f(x) for x in sequence if condition] # 'if' after 'for'
es: Supongo que estabas escribiendo una comprensión o una expresión generadora y utilizas el orden incorrecto para una condición. El orden correcto depende de si hay una cláusula `else` o no. Por ejemplo, el orden correcto para una comprensión de lista con condición puede ser [f(x) if condición else otro for x in secuencia] # 'if' antes de 'for' o, si no hay ningún `else` [f(x) for x in secuencia if condición] # 'if' despues de 'for'

source: You cannot have spaces in identifiers (variable names). Perhaps you meant `{name}`?
es: No puede haber espacios en los identificadores (nombres de variables). ¿Quizás se refería a `{name}`?

source: `bf` is an illegal string prefix.
es: `bf` es un prefijo de cadena no valido.

source: I am guessing that you wanted a binary f-string; this is not allowed.
es: Supongo que querías un f-string binario; esto no está permitido.

source: It is possible that you forgot a comma between items in a tuple, or between function arguments, at the position indicated by ^.
es: Es posible que haya olvidado una coma entre los elementos de una tupla, o entre los argumentos de una función, en la posición indicada por ^.

source: It is possible that you forgot a comma between items in a list at the position indicated by ^.
es: Es posible que haya olvidado una coma entre los elementos de una lista en la posición indicada por ^.

source: It is possible that you forgot a comma between items in a set or dict at the position indicated by ^.
es: Es posible que haya olvidado una coma entre los elementos de un set o dict en la posición indicada por ^.

source: Python indicates that the error is caused by `{second}` written immediately after `{first}`.
es: Python indica que el error es causado por `{second}` escrito inmediatamente después de `{first}`.

source: Perhaps you meant{line}
es: Tal vez quiso decir{line}.

source: Did you forget something between `{first}` and `{second}`?
es: ¿Olvidaste algo entre `{first}` y `{second}`?

source: Perhaps you meant to insert an operator like `{operators}` between `{first}` and `{second}`. The following lines of code would not cause any `SyntaxError`:
es: Tal vez usted quería insertar un operador como `{operators}` entre `{first}` y `{second}`. Las siguientes líneas de código no causarían ningún `SyntaxError`:

source: Note: these are just some of the possible choices and that some of them might raise other types of exceptions.
es: Nota: estas son sólo algunas de las opciones posibles y que algunas de ellas pueden generar otros tipos de excepciones.

source: There is an additional possibility.
es: Hay una posibilidad adicional.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict before or at the position indicated by ^.
es: Es posible que haya utilizado un signo igual `=` en lugar de dos puntos `:` para asignar valores a las claves de un dict antes o en la posición indicada por ^.

source: The Python keyword `{boolean}` can only be used for boolean expressions. Perhaps you meant to write `{new_statement}`
es: La palabra clave de Python `{boolean}` sólo puede utilizarse para expresiones booleanas. Quizás haya querido escribir `{new_statement}`

source: I am guessing that you are trying to import at least one object from module `{module}` and rename it using the Python keyword `as`; this keyword can only be used to rename one object at a time using a well defined syntax. I suggest that you split up any such import statement with each object renamed on a separate line as follows: from {module} import object_1 as name_1 from {module} import object_2 as name_2 # if needed
es: Supongo que estás intentando importar al menos un objeto del módulo `{module}` y renombrarlo usando la palabra clave de Python `as`; esta palabra clave sólo puede ser utilizada para renombrar un objeto a la vez utilizando una sintaxis bien definida. Le sugiero que divida cualquier declaración de importación con cada objeto renombrado en una línea separada como sigue: from {module} import objeto_1 as nombre_1 from {module} import objeto_2 as nombre_2 # si es necesario

source: I am guessing that you wrote {bad_token} twice in a row by mistake. If that is the case, you need to remove the second one.
es: Supongo que has escrito {bad_token} dos veces seguidas por error. Si ese es el caso, tienes que eliminar la segunda.

source: Did you write {bad_token} twice by mistake?
es: ¿Has escrito {bad_token} dos veces por error?

source: I am guessing that you wrote {bad_token} by mistake. Removing it and writing `{line}` seems to fix the error.
es: Supongo que has escrito {bad_token} por error. Quitándolo y escribiendo `{line}` parece que se solucionara el error.

source: Did you write {bad_token} by mistake?
es: ¿Has escrito {bad_token} por error?

source: It looks like the error occurred as you were writing a Python dict. Perhaps wrote a dict key without writing the corresponding value.
es: Parece que el error se ha producido al escribir un `dict` de Python. Tal vez escribió una clave de `dict` sin escribir el valor correspondiente.

source: The `else` keyword does not begin a code block that matches a valid code block, possibly because `else` is not indented correctly.
es: La palabra clave `else` no comienza un bloque de código que coincide con un bloque de código válido, posiblemente porque `else` no está indentado correctamente.

source: The `elif` keyword does not begin a code block that matches an `if` block, possibly because `elif` is not indented correctly.
es: La palabra clave `elif` no comienza un bloque de código que coincide con un bloque `if`, posiblemente porque `elif` no tiene el indentado correcto.

source: You used square brackets, `[...]` instead of parentheses.
es: Has utilizado corchetes, `[...]` en lugar de paréntesis.

source: Write the following instead: {new_statement}
es: Escriba lo siguiente en su lugar: {new_statement}

source: The opening {bracket} on line {linenumber} is not closed.
es: El {bracket} de apertura en la línea {linenumber} no está cerrado.

source: If this is incorrect, please report this case.
es: Si esto es incorrecto, por favor reporte este caso.

source: Perhaps you wrote a statement beginning a code block intended to be part of a generator expression. You cannot have separate code blocks inside generator expressions.
es: Tal vez usted escribió una declaración que comienza un bloque de código destinado a formar parte de una expresión del generador. No puedes tener bloques de código separados dentro de las expresiones del generador.

source: Perhaps you wrote a statement beginning a code block intended to be part of a list comprehension. You cannot have separate code blocks inside list comprehensions.
es: Tal vez usted escribió una declaración que comienza un bloque de código destinado a formar parte de una comprensión de lista. No se pueden tener bloques de código separados dentro de las comprensiones de listas.

source: Perhaps you wrote a statement beginning a code block intended to be part of a dict or set comprehension. You cannot have separate code blocks inside dict or set comprehensions.
es: Tal vez usted escribió una declaración que comienza un bloque de código destinado a formar parte de una comprensión dict o set. No puedes tener bloques de código separados dentro de las comprensiones dict o set.

source: If this explanation is incorrect, please report this case.
es: Si esta explicación es incorrecta, por favor informe de este caso.

source: parenthesis `(`
es: paréntesis `(`

source: parenthesis `)`
es: paréntesis `)`

source: square bracket `[`
es: corchete `[`

source: square bracket `]`
es: corchete `]`

source: curly bracket `{`
es: llave `{`

source: curly bracket `}`
es: llave `}`

source: Did you mean to use a normal quote character, `'` or `"`?
es: ¿Quería utilizar un carácter de comillas normal, `'` o `"`?

source: I suspect that you used a fancy unicode quotation mark whose name is {name} instead of a normal single or double quote for a string.
es: Sospecho que has utilizado una comilla unicode de fantasía cuyo nombre es {name} en lugar de una comilla simple o doble normal para una cadena.

source: Or perhaps, you meant to write a less than sign, `<`.
es: O tal vez, quisiste escribir un signo menos que, `<`.

source: Or perhaps, you meant to write a greater than sign, `>`.
es: O tal vez, quisiste escribir un signo mayor que, `>`.

source: Or perhaps, you meant to write a comma.
es: O tal vez, quisiste escribir una coma.

source: I suspect that you used a fancy unicode quotation mark whose name is {name}.
es: Sospecho que has utilizado una comilla elegante unicode cuyo nombre es {name}.

source: Perhaps, you meant to write a less than sign, `<`.
es: Tal vez, quisiste escribir un signo menos que, `<`.

source: Did you mean to write a less than sign, `<`?
es: ¿Querías escribir un signo menos que, `<`?

source: Perhaps, you meant to write a greater than sign, `>`.
es: Tal vez, quisiste escribir un signo mayor que, `>`.

source: Did you mean to write a greater than sign, `>`?
es: ¿Querías escribir un signo mayor que, `>`?

source: Perhaps, you meant to write a comma.
es: Tal vez, quisiste escribir una coma.

source: I suspect that you used the unicode character known as 'FRACTION SLASH', which looks similar to but is different from the division operator `/`.
es: Sospecho que has utilizado el carácter unicode conocido como 'FRACTION SLASH', que es similar a pero es diferente del operador de división `/`.

source: Did you use a unicode fraction?
es: ¿Usaste una fracción unicode?

source: I suspect that you used the unicode character `{char}`meant to represent a fraction. The name of this unicode character is {name}.
es: Sospecho que has utilizado el carácter unicode `{char}` para representar una fracción. El nombre de este carácter unicode es {name}.

source: Did you mean `{num}/{denom}`?
es: ¿Quieres decir `{num}/{denom}`?

source: You used the unicode character {char} which is known as {name} I suspect that you meant to write the fraction `{num}/{denom}` instead.
es: Has utilizado el carácter unicode {char} que se conoce como {name} Sospecho que querías escribir la fracción `{num}/{denom}` en su lugar.
