Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: Perhaps you meant to write `{operator}=` instead of `={operator}`
es: Tal vez quiso escribir `{operator}=` en lugar de `={operator}`

source: You tried to use the unary operator '{operator}' with the following type of object: {obj}. This operation is not defined for this type of object.
es: Has intentado utilizar el operador unario '{operator}' con el siguiente tipo de objeto {obj}. La operación no está definida para este tipo de objeto.

source: In Python, some objects are known as immutable: once defined, their value cannot be changed. You tried change part of such an immutable object: {obj}, most likely by using an indexing operation.
es: En Python, algunos objetos se conocen como inmutables: una vez definidos, su valor no puede ser cambiado. Has intentado cambiar parte de un objeto inmutable de este tipo: {obj}, probablemente utilizando una operación de indexación.

source: Did you mean to use a list?
es: ¿Querías usar una lista?

source: Perhaps you meant to use a list instead.
es: Tal vez quisiste usar una lista en su lugar.

source: In Python 3, exceptions must be derived from BaseException.
es: En Python 3, las excepciones deben derivarse de `BaseException`.

source: You apparently have called the function `{fn_name}` with {nb_given} positional argument(s) while it requires {nb_required} such positional argument(s).
es: Al parecer, ha llamado a la función `{fn_name}` con {nb_given} argumento(s) posicional(es) mientras que requiere {nb_required} dicho(s) argumento(s) posicional(es).

source: Perhaps you forgot `self` when defining `{fn_name}`.
es: Tal vez olvidó `self` al definir `{fn_name}`.

source: You apparently have called the function '{fn_name}' with fewer positional arguments than it requires ({nb_required} missing).
es: Al parecer, ha llamado a la función '{fn_name}' con menos argumentos posicionales de los que requiere (falta {nb_required}).

source: Note: `NoneType` means that the object has a value of `None`.
es: Nota: `NoneType` significa que el objeto tiene un valor de `None`.

source: Python indicates that you have an object of type `{obj_type}`, followed by something surrounded by parentheses, `(...)`, which Python took as an indication of a function call. Either the object of type `{obj_type}` was meant to be a function, or you forgot a comma before `(...)`.
es: Python indica que tienes un objeto de tipo `{obj_type}`, seguido de algo rodeado de paréntesis, `(...)`, que Python toma como indicación de una llamada a una función. O bien el objeto de tipo `{obj_type}` estaba destinado a ser una función, o se ha olvidado una coma antes de `(...)`.

source: The parenthesis `()` following `{obj_name}` are interpreted by Python as a function call for `{obj_name}`. However, `{obj_name}` is not a function but an object of type `{obj_type}`.
es: Los paréntesis `()` que siguen a `{obj_name}` son interpretados por Python como una llamada a una función para `{obj_name}`. Sin embargo, `{obj_name}` no es una función sino un objeto de tipo `{obj_type}`.

source: Because of the surrounding parenthesis, `{fn_call}` is interpreted by Python as indicating a function call for `{obj_name}`, which is an object of type `{obj_type}` which cannot be called.
es: Debido a los paréntesis que lo rodean, `{fn_call}` es interpretado por Python como una llamada a una función para `{obj_name}`, que es un objeto de tipo `{obj_type}` que no puede ser llamado.

source: However, `{fn_call}` is a `tuple`. Either the object `{obj_name}` was meant to be a function or you have a missing comma between the object `{obj_name}` and the tuple `{fn_call}` and meant to write `{obj_name}, {fn_call}`.
es: Sin embargo, `{fn_call}` es una `tupla`. O bien el objeto `{obj_name}` debía ser una función o falta una coma entre el objeto `{obj_name}` y la tupla y la tupla `{fn_call}` y querías escribir `{obj_name}, {fn_call}`.

source: Did you forget a comma between `{obj_name}` and `{fn_call}`?
es: ¿Olvidaste una coma entre `{obj_name}` y `{fn_call}`?

source: However, `{obj_name}` is a sequence. Perhaps you meant to use `[]` instead of `()` and write `{obj_name}[{slice}]`
es: Sin embargo, `{obj_name}` es una secuencia. Tal vez usted quería usar `[]` en lugar de `()` y escribir `{obj_name}[{slice}]`

source: Did you mean `{obj_name}[{slice}]`?
es: ¿Quiere decir `{obj_name}[{slice}]`?

source: However, both `{obj_name}` and `{fn_call}` are numbers. Perhaps you forgot a multiplication operator, `*`, and meant to write `{obj_name} * {fn_call}`.
es: Sin embargo, tanto `{obj_name}` como `{fn_call}` son números. Tal vez olvidó un operador de multiplicación, `*`, y quiso escribir `{obj_name}` * {fn_call}`.

source: Did you mean `{obj_name} * {fn_call}`?
es: ¿Se refiere a `{obj_name}` * {fn_call}`?

source: Did you forget to convert `{name}` into an integer?
es: ¿Olvidaste convertir `{name}` en un número entero?

source: Perhaps you forgot to convert `{name}` into an integer.
es: Tal vez hayas olvidado convertir `{name}` en un número entero.

source: You can only multiply sequences, such as list, tuples, strings, etc., by integers.
es: Sólo se pueden multiplicar secuencias, como listas, tuplas cadenas, etc., por enteros.

source: Did you forget to convert `{name1}` and `{name2}` into integers?
es: ¿Has olvidado convertir `{name1}` y `{name2}` en enteros?

source: Perhaps you forgot to convert `{name1}` and `{name2}` into integers.
es: Tal vez olvidó convertir `{name1}` y `{name2}` en enteros.

source: You wrote an object whose value is `None` where an integer was expected.
es: Has escrito un objeto cuyo valor es `None` donde se esperaba un entero.

source: You wrote an object of type `{obj}` where an integer was expected.
es: Has escrito un objeto de tipo `{obj}` donde se esperaba un entero.

source: Did you forget to convert `{names}` into integers?
es: ¿Olvidaste convertir `{names}` en enteros?

source: Perhaps you forgot to convert `{names}` into integers.
es: Tal vez olvidó convertir `{names}` en enteros.

source: In the expression `{line}` what is included between the square brackets, `[...]`, must be either an integer or a slice (`start:stop` or `start:stop:step`) and you have used {obj_type} instead.
es: En la expresión `{line}` lo que se incluye entre los corchetes, `[...]`, debe ser un número entero o un slice (`inicio:parada` o `inicio:parada:paso`) y se ha utilizado {obj_type} en su lugar.

source: Note: sometimes this exception is raised because what Python interprets as indices was meant to be a separate list, and a comma should have been written before the opening `[` of that list.
es: Nota: a veces se produce esta excepción porque lo que Python interpreta como índices se supone que es una lista separada, y una coma debería haberse escrito antes de la apertura `[` de esa lista.

source: Did you forget a comma?
es: ¿Te has olvidado de una coma?

source: Perhaps you have forgotten a comma between two identical lists `{container}`. The second list had been interpreted as the indexation of the first one by the index `{new_index}`
es: Tal vez haya olvidado una coma entre dos listas idénticas `{container}`. La segunda lista había sido interpretada como la indexación de la primera por el índice `{new_index}`

source: Perhaps you have forgotten a comma between the object `{container}` and the list `{index}`. The list `{index}` had been interpreted as the indexation of object `{container}` by the index `{new_index}`
es: Tal vez haya olvidado una coma entre el objeto `{container}` y la lista `{index}`. La lista `{index}` había sido interpretada como la indexación del objeto `{container}` por el índice `{new_index}`

source: Did you forget a comma before `{index}`?
es: ¿Olvidaste una coma antes de `{index}`?

source: When using a slice to extract a range of elements from a sequence, that is something like `[start:stop]` or `[start:stop:step]` each of `start`, `stop`, `step` must be either an integer, `None`, or possibly some other object having an `__index__` method.
es: Cuando se utiliza un slice para extraer un rango de elementos de una secuencia, es decir, algo como `[inicio:parada]` o `[inicio:parada:paso]`. cada uno de los elementos `inicio`, `parada`, `paso` debe ser un entero, `None`, o posiblemente algún otro objeto que tenga un método `__index__`.

source: Only hashable objects can be used as elements of `set` or keys of `dict`. Hashable objects are objects that do not change value once they have been created.
es: Sólo se pueden utilizar objetos hasheables como elementos de `set` o claves de `dict`. Los objetos hasheables son aquellos que no cambian de valor una vez que han sido creados.

source: Instead of using {original}, consider using {replacement}.
es: En lugar de usar {original}, considere usar {replacement}.

source: Subscriptable objects are typically containers from which you can retrieve item using the notation `[...]`.
es: Los objetos subscribibles son típicamente contenedores de los cuales se puede recuperar un elemento utilizando la notación `[...]`.

source: Using this notation, you attempted to retrieve an item from an object of type `{obj_type}` which is not allowed.
es: Utilizando esta notación, ha intentado recuperar un elemento de un objeto de tipo `{tipo_obj}` que no está permitido.

source: Perhaps you meant to write `{line}`.
es: Tal vez quiso escribir `{line}`.

source: Using this notation, you attempted to retrieve an item from `{name}`, an object of type `{obj_type}`. This is not allowed.
es: Utilizando esta notación, has intentado recuperar un elemento de `{name}`, un objeto de tipo `{obj_type}`. Esto no está permitido.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. '{obj_name}' is not a container. A container is required here.
es: Un iterable es un objeto capaz de devolver sus miembros de uno en uno. Los contenedores de Python (`lista, tupla, dict`, etc.) son iterables. '{obj_name}' no es un contenedor. Aquí se requiere un contenedor.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables. An iterable is required here.
es: Un iterable es un objeto capaz de devolver sus miembros de uno en uno. Los contenedores de Python (`lista, tupla, dict`, etc.) son iterables. Aquí se requiere un iterable.

source: Unpacking is a convenient way to assign a name, to each item of an iterable.
es: El desempaquetado es una forma conveniente de asignar un nombre a cada elemento de un iterable.

source: An iterable is an object capable of returning its members one at a time. Python containers (`list, tuple, dict`, etc.) are iterables, but not objects of type `{obj_type}`.
es: Un iterable es un objeto capaz de devolver sus miembros de uno en uno. Los contenedores de Python (`list, tuple, dict`, etc.) son iterables, pero no objetos de tipo `{obj_type}`.

source: {function} does not accept a sequence as an argument. Instead of writing `{line}` perhaps you should use the `dict.fromkeys()` method: `{new_line}`.
es: {function} no acepta una secuencia como argumento. En lugar de escribir `{line}` tal vez debería utilizar el método `dict.fromkeys()`: `{new_line}`.

source: Perhaps you need to use the `dict.fromkeys()` method.
es: Tal vez necesite utilizar el método `dict.fromkeys()`.

source: Did you forget to call `{name}`?
es: ¿Olvidaste llamar a `{name}`?

source: I suspect that you forgot to add parentheses to call `{name}`. You might have meant to write: `{line}`
es: Sospecho que has olvidado añadir paréntesis para llamar a `{name}`. Puede que hayas querido escribir: `{line}`

source: The function `vars` is used to list the content of the `__dict__` attribute of an object.
es: La función `vars` se utiliza para listar el contenido del atributo `__dict__` de un objeto.

source: Object `{name}` uses `__slots__` instead of `__dict__`.
es: El objeto `{name}` utiliza `__slots__` en lugar de `__dict__`.

source: `{name}`, the argument of `vars`, is an object without such an attribute.
es: `{name}`, el argumento de `vars`, es un objeto sin dicho atributo.

source: You have specified the value of argument `{argument}` more than once when calling the function named `{function}`.
es: Ha especificado el valor del argumento `{argument}` más de una vez al llamar a la función llamada `{function}`.

source: This function has only one argument: `{arguments}`
es: Esta función sólo tiene un argumento: `{arguments}`

source: This function has the following arguments: `{arguments}`
es: Esta función tiene los siguientes argumentos: `{arguments}`

source: You likely need to build a list first.
es: Es probable que primero tengas que crear una lista.

source: You're trying to use the name `{name}` identified by Python as being in the local scope of a function before having assigned it a value.
es: Estás tratando de usar el nombre `{name}` identificado por Python como estando en el ámbito local de una función antes de haberle asignado un valor.

source: The name `{var_name}` exists in both the global and nonlocal scope. This can be rather confusing and is not recommended. Depending on which variable you wanted to refer to, you needed to add either global {var_name} or nonlocal {var_name} as the first line inside your function.
es: El nombre `{var_name}` existe tanto en el ámbito global como en el no local. Esto puede ser bastante confuso y no es recomendable. Dependiendo de la variable a la que quiera referirse, deberá añadir global {var_name} o nonlocal {var_name} como la primera línea dentro de su función.

source: Did you forget to add either `global {var_name}` or `nonlocal {var_name}`?
es: ¿Olvidó añadir `global {var_name}` o `nonlocal {var_name}`?

source: `{name}` is a Python builtin function. You have tried to assign a value to `{name}` inside a function while also using its original meaning in the function. Note that it is generally not a good idea to give a local variable the same name as a Python builtin function (like `{name}`).
es: `{name}` es una función incorporada de Python. Has intentado asignar un valor a `{name}` dentro de una función al mismo tiempo que utilizas su significado original en la función. Tenga en cuenta que generalmente no es una buena idea dar a una variable local el mismo nombre que a una función incorporada de Python (como `{name}`).

source: The name `{var_name}` exists in the {scope} scope. Perhaps the statement {scope} {var_name} should have been included as the first line inside your function.
es: El nombre `{var_name}` existe en el ámbito {scope}. Quizás la sentencia {scope} {var_name} debería haber sido incluida como la primera línea dentro de su función.

source: Did you forget to add `{scope} {var_name}`?
es: ¿Olvidaste añadir `{scope} {var_name}`?

source: The similar name `{name}` was found in the local scope.
es: Se ha encontrado el nombre similar `{name}` en el ámbito local.

source: In this instance, there are more names ({nb_names}) than {length}, the length of the iterable.
es: En este caso, hay más nombres ({nb_names}) que {length}, la longitud del iterable.

source: In this instance, there are more names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
es: En este caso, hay más nombres ({nb_names}) que la longitud del iterable, {iter_type} de longitud {length}.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable.
es: En este caso, hay menos nombres ({nb_names}) que la longitud del iterable.

source: In this instance, there are fewer names ({nb_names}) than the length of the iterable, {iter_type} of length {length}.
es: En este caso, hay menos nombres ({nb_names}) que la longitud del iterable, {iter_type} de longitud {length}.

source: `int()` expects an argument that looks like a number in base `{base}` but you gave it an empty string.
es: `int()` espera un argumento que parezca un número en base `{base}` pero le has dado una cadena vacía.

source: `{value}` is an invalid argument for `int()` in base `{base}`.
es: `{value}` es un argumento no válido para `int()` en base `{base}`.

source: The following characters are not allowed: `{invalid}`.
es: Los siguientes caracteres no están permitidos: `{invalid}`.

source: When base `0` is specified, `int()` expects the argument to be an integer literal, written in base 2 (`0b...`), 8 (`0o...`), 10, or 16 (`0x...`).
es: Cuando se especifica la base `0`, `int()` espera que el argumento sea un literal entero, escrito en base 2 (`0b...`), 8 (`0o...`), 10, o 16 (`0x...`).

source: In base `{base}`, `int()` is most often use to convert a string containing the digits `0` to `{max_n}` into an integer.
es: En base `{base}`, `int()` se utiliza más a menudo para convertir una cadena que contiene los dígitos `0` a `{max_n}` en un número entero.

source: In base `11`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letter `'a'` into an integer.
es: En base `11`, `int()` se utiliza más a menudo para convertir una cadena que contiene los dígitos "0" a "9" y la letra "a" en un número entero.

source: In base `base`, `int()` is most often use to convert a string containing the digits `0` to `9` and the letters from `'a'` to `'{max_n}'` into an integer.
es: En base `base`, `int()` se utiliza más a menudo para convertir una cadena que contiene los dígitos "0" a "9" y las letras desde `'a'` hasta `'{max_n}'` en un número entero.

source: You need to convert `'{value}'` to a float first.
es: Primero hay que convertir `'{value}` en un float.

source: The string `'{value}'` needs to be first converted using `float()` before the result can be converted into an integer using `int()`.
es: La cadena `'{value}` necesita ser convertida primero usando `float()` antes de poder convertir el resultado en un entero con `int()`.

source: The argument `base` of `int()` must be either zero or any integer from 2 to 36.
es: El argumento `base` de `int()` debe ser cero o un número entero entre 2 y 36.

source: You wrote {base} which is not allowed.
es: Has escrito {base} que no está permitido.

source: Did you specify an invalid month?
es: ¿Especificó un mes no válido?

source: I am guessing that you specify an invalid value for a month in a `date` object. Valid values are integers, from 1 to 12.
es: Supongo que especifica un valor no válido para un mes en un objeto `date`. Los valores válidos son enteros, del 1 al 12.

source: The string `{string}` cannot be converted to a `float`.
es: La cadena `{string}` no se puede convertir en un `float`.

source: The name `{var}` is used both as the name of a class variable and as a string item in the class `__slots__`; this is not allowed.
es: El nombre `{var}` se utiliza tanto como nombre de una variable de clase y como elemento de cadena en la clase `__slots__`; esto no está permitido.

source: The third argument of the function `pow()` cannot be zero.
es: El tercer argumento de la función `pow()` no puede ser cero.

source: I do not recognize this error message. I am guessing that the problem is with the function `{name}`.
es: No reconozco este mensaje de error. Supongo que el problema está en la función `{name}`.

source: Its docstring is: {docstring}
es: Su docstring es: {docstring}

source: I have no more information.
es: No tengo mas información.

source: The value you gave for the time is not in the format you specified. Make sure to use the same separator between items (for example, between day and month) and keep the order the same in both the data provided and the format you specified. The following table might be useful: https://docs.python.org/3/library/time.html#time.strftime The following site might also be useful: https://www.strfti.me/
es: El valor que has dado para la hora no está en el formato que has especificado. Asegúrese de utilizar el mismo separador entre los elementos (por ejemplo, entre el día y el mes) y mantener el mismo orden tanto en los datos proporcionados como en el formato que ha especificado. La siguiente tabla puede ser útil: https://docs.python.org/3/library/time.html#time.strftime El siguiente sitio también puede ser útil: https://www.strfti.me/

source: Using the modulo operator, you are dividing by zero.
es: Usando el operador módulo, estás dividiendo por cero.

source: You are dividing by zero.
es: Estás dividiendo por cero.

source: You are dividing by the following term {expression} which is equal to zero.
es: Usted está dividiendo por el siguiente término {expression} que es igual a cero.

source: The following mathematical expression includes a division by zero: {expression}
es: La siguiente expresión matemática incluye una división por cero: {expression}

source: Using the modulo operator, you are dividing by the following term {expression} which is equal to zero.
es: Usando el operador de módulo, estás dividiendo por el siguiente término {expression} que es igual a cero.

source: The second argument of the `divmod()` function is zero.
es: El segundo argumento de la función `divmod()` es cero.

source: You are attempting to raise the number 0 to a negative power which is equivalent to dividing by zero.
es: Estás intentando elevar el número 0 a una potencia negativa que equivalente a dividir por cero.

source: The following mathematical expression includes a division by zero done using the modulo operator: {expression}
es: La siguiente expresión matemática incluye una división por cero realizada con el operador módulo: {expression}

source: The second argument of the `divmod()` function is equal to zero.
es: El segundo argumento de la función `divmod()` es igual a cero.

source: Currently, I cannot guess the likely cause of this error. Try to examine closely the line indicated as well as the line immediately above to see if you can identify some misspelled word, or missing symbols, like (, ), [, ], :, etc. Unless your code uses type annotations, which are beyond our scope, if you think that this is something which should be handled by friendly, please report this case to https://github.com/friendly-traceback/friendly-traceback/issues
es: Actualmente, no puedo detectar la causa probable de este error. Intente examinar detenidamente la línea indicada, así como la línea inmediatamente superior para ver si puede identificar alguna palabra mal escrita o símbolos que falten, como (, ), [, ], :, etc. A menos que su código utilice anotaciones de tipo, que están fuera de nuestro alcance, si cree que esto es algo que debería ser manejado por friendly, por favor reporte este caso a https://github.com/friendly-traceback/friendly-traceback/issues

source: Python told us that it expected a colon at the position indicated. However, adding a colon or replacing something else by a colon would not fix the problem.
es: Python nos dijo que esperaba dos puntos en la posición indicada. Sin embargo, añadir dos puntos o sustituir algo por dos puntos no solucionaría el problema.

source: Python gave us the following informative message about the possible cause of the error: {message} However, I do not recognize this information and I have to guess what caused the problem, but I might be wrong.
es: Python nos dio el siguiente mensaje informativo sobre la posible causa del error: {message} Sin embargo, no reconozco esta información y tengo adivinar la causa del problema, pero puedo estar equivocado.

source: However, making such a change would still not correct all the syntax errors in the code you wrote.
es: Sin embargo, hacer tal cambio no corregiría todos los errores de sintaxis en el código que escribiste.

source: The correct syntax is: {async_}def name ( ... ):
es: La sintaxis correcta es: {async_}def name ( ... ):

source: A function needs a name.
es: Una función necesita un nombre.
