Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: The file {filename} does not exist.
es: El archivo {filename} no existe.

source: The available languages are:
es: Los idiomas disponibles son:

source: Warning issued on line `{line}` of code block {filename}.
es: Excepción elevada en la linea `{line}` del bloque de código {filename}.

source: Warning issued on line `{line}` of file '{filename}'.
es: Excepción elevada en la linea `{line}` del archivo '{filename}'.

source: I have no suggestion to offer.
es: No tengo una sugerencia para ofrecer.

source: I have no suggestion to offer; try `why()`.
es: No tengo una sugerencia para ofrecer; intenta con `why()`.

source: Are you using a regular Python console instead of a Friendly console? If so, to continue, try: `start_console(local_vars=locals())`. You will need to import `start_console` if you have not already done so.
es: ¿Estás usando una consola normal de Python en lugar de una consola Friendly? Si es así, para continuar, prueba: `start_console(local_vars=locals())`. Tendrás que importar `start_console` si no lo has hecho ya.

source: Nothing to show: no exception recorded.
es: Nada para mostrar: no se registró una excepción.

source: An exception occurred before friendly-traceback was imported. Some information is available.
es: Se ha producido una excepción antes de importar el friendly-traceback. Hay alguna información disponible.

source: Shows a list of recorded traceback messages.
es: Muestra una lista de los mensajes de traceback registrados.

source: {exception} is not an exception.
es: {exception} no es una excepción.

source: Invalid argument for `www()`. Valid arguments include `None` or one of `{sites}`.
es: Argumento no valido para `www()`. Los argumentos validos incluyen `None` o alguno de `{sites}`.

source: The default web browser cannot be used for searching.
es: El navegador web por defecto no se puede utilizar para la búsqueda.

source: The following methods of the Friendly object should also be available as functions.
es: Los siguientes métodos del objeto Friendly también deberían estar disponibles como funciones.

source: More lines not shown.
es: Más lineas no mostradas.

source: Python exception:
es: Excepción Python:

source: Warning: improperly formed exception. I suspect that a custom exception has been raised with a non-string value used as a message. This can occur if a `__repr__` or a `__str__` method raises an exception or does not return a string.
es: Advertencia: excepción mal formada. Sospecho que se ha lanzado una excepción personalizada con un valor que no es una cadena utilizado como mensaje. Esto puede ocurrir si un método `__repr__` o un método `__str__` lanza una excepción o no devuelve una cadena.

source: The encoding of the file was not valid.
es: La codificación del archivo no era valida.

source: {filename} is not a regular Python file whose contents can be analyzed.
es: {filename} no es un archivo regular de Python cuyo contenido pueda ser analizado.

source: Exception raised on line `{linenumber}` of code block {filename}.
es: Excepción elevada en la linea `{linenumber}` del bloque de código '{filename}'.

source: Exception raised on line `{linenumber}` of file '{filename}'.
es: Excepción elevada en la linea `{linenumber}` del archivo '{filename}'.

source: Execution stopped on line `{linenumber}` of code block {filename}.
es: La ejecución se detuvo en la linea `{linenumber}` del bloque de código{filename}.

source: Execution stopped on line `{linenumber}` of file '{filename}'.
es: La ejecución se detuvo en la linea `{linenumber}` del archivo '{filename}'.

source: File '{filename}', line `{line}`
es: Archivo {filename}, línea `{line}`

source: The entire content of `{filename}` is not available.
es: El contenido completo de `{filename}` no está disponible.

source: Python could not understand the code in the code block {filename}
es: Python no pudo entender el código en el bloque de código {filename}

source: Python could not understand the code in the file '{filename}'
es: Python no pudo entender el código en el archivo '{filename}'

source: at the location indicated.
es: en la ubicación indicada.

source: Unfortunately, no additional information is available: the content of file '<stdin>' is not accessible.
es: Lamentablemente, no hay información adicional disponible: el contenido del archivo '<stdin>' no es accesible.

source: Fatal error - aborting
es: Error fatal - abortando

source: Please report this issue.
es: Por favor, informe de este problema.

source: Problem: source of `{filename}` is not available
es: Problema: la fuente de `{filename}` no está disponible

source: Type 'Friendly' for help on special functions/methods.
es: Escriba 'Friendly' para obtener ayuda sobre funciones/métodos especiales.

source: Please report this example to https://github.com/friendly-traceback/friendly-traceback/issues/new If you are using a REPL, use `www('bug')` to do so.
es: Por favor, informe de este ejemplo a https://github.com/friendly-traceback/friendly-traceback/issues/new Si está utilizando un REPL, utilice `www('bug')` para hacerlo.

source: Friendly-traceback does not know the cause of this error.
es: Friendly-traceback no conoce la causa de este error.

source: No information is known about this exception.
es: No se conoce ninguna información sobre esta excepción.

source: If you are using the Friendly console, use `www()` to do an Internet search for this particular case.
es: Si está utilizando la consola Friendly, utilice `www()` para hacer una búsqueda en Internet para este caso en particular.

source: Internal error for Friendly.
es: Error interno para Friendly.

source: Shows all the information about the last traceback.
es: Muestra toda la información sobre el último traceback.

source: Sets the language to be used.
es: Establece el idioma a utilizar.

source: Shows the paths corresponding to synonyms used.
es: Muestra las rutas correspondientes a los sinónimos utilizados.

source: Shows the generic meaning of a given exception.
es: Muestra el significado genérico de una determinada excepción.

source: Shows where an exception was raised.
es: Muestra dónde se ha producido una excepción.

source: Shows the likely cause of the exception.
es: Muestra la causa probable de la excepción.

source: Opens a web browser at a useful location.
es: Abre un navegador web en una ubicación útil.

source: Suggestion sometimes added to a friendly traceback.
es: Sugerencia que a veces se añade a un traceback amistoso.

source: Shows a normal Python traceback.
es: Muestra un traceback normal de Python.

source: Shows a simplified Python traceback.
es: Muestra un traceback simplificado de Python.

source: Returns the current value used for items to include by default.
es: Devuelve el valor actual utilizado para los elementos a incluir por defecto.

source: Sets the items to show by default when an exception is raised.
es: Establece los elementos a mostrar por defecto cuando se produce una excepción.

source: Returns the language currently used.
es: Devuelve el idioma utilizado actualmente.

source: Sets the formatter to use for display.
es: Establece el formateador que será utilizado para mostrar.

source: Use True (default) or False to enable debugging methods.
es: Utilice True (por defecto) o False para activar los métodos de depuración.

source: An exception of type `{name}` is a subclass of `{parent}`.
es: Una excepción del tipo `{name}` es subclase de `{parent}`.

source: `ArithmeticError` is the base class for those built-in exceptions that are raised for various arithmetic errors. It is unusual that you are seeing this exception; normally, a more specific exception should have been raised.
es: `ArithmeticError` es la clase base para aquellas excepciones integradas al lenguaje que se producen por diversos errores aritméticos. Es inusual que veas esta excepción; normalmente, una excepción más específica debería haber sido lanzada.

source: In Python, the keyword `assert` is used in statements of the form `assert condition`, to confirm that `condition` is not `False`, nor equivalent to `False` such as an empty list, etc. If `condition` is `False` or equivalent, an `AssertionError` is raised.
es: En Python, la palabra clave `assert` se utiliza en sentencias de la forma `assert condition`, para confirmar que `condition` no es `False`, ni equivalente a `False`, como una lista vacía, etc. Si `condición` es `False` o equivalente, se produce un `AssertionError`.

source: An `AttributeError` occurs when the code contains something like `object.x` and `x` is not a method or attribute (variable) belonging to `object`.
es: Un `AttributeError` ocurre cuando el código contiene algo como objeto.x y `x` no es un método o atributo (variable) perteneciente al `objeto`.

source: An `EOFError` is raised when the `input()` function hits an end-of-file condition (EOF) without reading any data.
es: Se produce un `EOFError` cuando la función `input()` alcanza una condición de fin de archivo (EOF) sin leer ningún dato.

source: A `FileNotFoundError` exception indicates that you are trying to open a file that cannot be found by Python. This could be because you misspelled the name of the file.
es: Una excepción `FileNotFoundError` indica que estas tratando de abrir un archivo que no puede ser encontrado por Python. Esto puede deberse a que has escrito mal el nombre del archivo.

source: An `ImportError` exception indicates that a certain object could not be imported from a module or package. Most often, this is because the name of the object is not spelled correctly.
es: Una excepción `ImportError` indica que un determinado objeto no pudo importarse de un módulo o paquete. La mayoría de las veces, esto se debe a que porque el nombre del objeto no está escrito correctamente.

source: An `IndentationError` occurs when a given line of code is not indented (aligned vertically with other lines) as expected.
es: Un `IndentationError` ocurre cuando una línea de código dada no está con la indentación (alineada verticalmente con otras líneas) que se espera.

source: An `IndexError` occurs when you try to get an item from a list, a tuple, or a similar object (sequence), and use an index which does not exist; typically, this happens because the index you give is greater than the length of the sequence.
es: Un `IndexError` se produce cuando se intenta obtener un elemento de una lista una tupla, o un objeto similar (secuencia), y utiliza un índice que no existe; normalmente, esto ocurre porque el índice que se da es mayor que la longitud de la secuencia.

source: A `KeyError` is raised when a value is not found as a key in a Python dict or in a similar object.
es: Se produce un `KeyError` cuando no se encuentra un valor como llave en un dict de Python o en un objeto similar.

source: `LookupError` is the base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid. It can also be raised directly by codecs.lookup().
es: `LookupError` es la clase base para las excepciones que se producen cuando una clave o índice utilizado en un mapeo o secuencia no es válido. También puede ser elevada directamente por codecs.lookup().

source: Like the name indicates, a `MemoryError` occurs when Python runs out of memory. This can happen if you create an object that is too big, like a list with too many items.
es: Como su nombre indica, un `MemoryError` ocurre cuando Python se queda sin memoria. Esto puede ocurrir si se crea un objeto que es demasiado grande, como una lista con demasiados elementos.

source: A `ModuleNotFoundError` exception indicates that you are trying to import a module that cannot be found by Python. This could be because you misspelled the name of the module or because it is not installed on your computer.
es: Una excepción `ModuleNotFoundError` indica que estás está tratando de importar un módulo que no puede ser encontrado por Python. Esto puede deberse a que has escrito mal el nombre del módulo o porque no está instalado en tu computadora.

source: A `NameError` exception indicates that a variable or function name is not known to Python. Most often, this is because there is a spelling mistake. However, sometimes it is because the name is used before being defined or given a value.
es: Una excepción `NameError` indica que una variable o nombre de función no es conocido por Python. La mayoría de las veces, esto se debe a un error ortográfico. Sin embargo, a veces es porque el nombre se utiliza antes de ser definido o de recibir un valor.

source: An `OSError` exception is usually raised by the Operating System to indicate that an operation is not allowed or that a resource is not available.
es: El sistema operativo suele lanzar una excepción `OSError` para indicar que una operación para indicar que una operación no está permitida o que un recurso no está disponible.

source: An `OverflowError` is raised when the result of an arithmetic operation is too large to be handled by the computer's processor.
es: Se produce un `OverflowError` cuando el resultado de una operación aritmética es demasiado grande para ser manejado por el procesador del ordenador.

source: A `RecursionError` is raised when a function calls itself, directly or indirectly, too many times. It almost always indicates that you made an error in your code and that your program would never stop.
es: Un `RecursionError` se levanta cuando una función se llama a sí misma directa o indirectamente, demasiadas veces. Casi siempre indica que has cometido un error en tu código y que su programa nunca se detendrá.

source: `StopIteration` is raised to indicate that an iterator has no more item to provide when its `__next__` method is called by the `next()` builtin function.
es: `StopIteration` se eleva para indicar que un iterador no tiene más elementos para proporcionar cuando su método `__next__` es llamado por la función incorporada `next()`.

source: A `SyntaxError` occurs when Python cannot understand your code.
es: Un `SyntaxError` ocurre cuando Python no puede entender tu código.

source: A `TabError` indicates that you have used both spaces and tab characters to indent your code. This is not allowed in Python. Indenting your code means to have block of codes aligned vertically by inserting either spaces or tab characters at the beginning of lines. Python's recommendation is to always use spaces to indent your code.
es: Un `TabError` indica que ha utilizado tanto espacios y caracteres de tabulación para indentar tu código. Esto no está permitido en Python. Indentar tu código significa tener un bloque de código alineado verticalmente insertando espacios o caracteres de tabulación al principio de las líneas. La recomendación de Python es utilizar siempre espacios para sangrar el código.

source: A `TypeError` is usually caused by trying to combine two incompatible types of objects, by calling a function with the wrong type of object, or by trying to do an operation not allowed on a given type of object.
es: Un `TypeError` suele producirse al intentar combinar dos tipos de objetos incompatibles, por llamar a una función con el tipo de objeto equivocado, o por intentar realizar una operación no permitida en un tipo de objeto determinado.

source: A `ValueError` indicates that a function or an operation received an argument of the right type, but an inappropriate value.
es: Un `ValueError` indica que una función o una operación recibió un argumento del tipo correcto, pero un valor inapropiado.

source: In Python, variables that are used inside a function are known as local variables. Before they are used, they must be assigned a value. A variable that is used before it is assigned a value is assumed to be defined outside that function; it is known as a `global` (or sometimes `nonlocal`) variable. You cannot assign a value to such a global variable inside a function without first indicating to Python that this is a global variable, otherwise you will see an `UnboundLocalError`.
es: En Python, las variables que se utilizan dentro de una función sé conocen como variables locales. Previo a ser empleadas, se les debe asignar un valor. Una variable que se emplea antes de que se le asigne un valor se supone que está definida fuera de esa función; se conoce como `global` (o a veces `no local`). No se puede asignar un valor a dicha variable global dentro de una función sin indicar primero a Python que se trata de una variable global, de lo contrario verá un `UnboundLocalError`.

source: A `ZeroDivisionError` occurs when you are attempting to divide a value by zero either directly or by using some other mathematical operation.
es: Un `ZeroDivisionError` ocurre cuando se intenta dividir un valor por cero, ya sea directamente o utilizando alguna otra operación matemática.

source: a complex number
es: un número complejo

source: a dictionary (`dict`)
es: un diccionario (`dict`)

source: a number (`float`)
es: un número (`float`)

source: a `frozenset`
es: un `frozenset`

source: an integer (`int`)
es: un número entero (`int`)

source: a `list`
es: una `list`

source: a variable equal to `None` (`NoneType`)
es: una variable igual a `None` (`NoneType`)

source: a `set`
es: un `set`

source: a string (`str`)
es: un string (`str`)

source: a `tuple`
es: una `tuple`

source: Object too large to be processed by Python.
es: Objeto demasiado grande para ser procesado por Python.

source: A type hint found for `{name}` in the {scope} scope. Perhaps you had used a colon instead of an equal sign and wrote {name} : {hint} instead of {name} = {hint}
es: Se ha encontrado un type hint para `{name}` en el ámbito {scope}. Tal vez haya utilizado dos puntos en lugar de un signo de igualdad y haya escrito {name} : {hint} en lugar de {name} = {hint}

source: The default directory is {dirname}.
es: El directorio por defecto es {dirname}.

source: Did you give your program the same name as a Python module?
es: ¿Has dado a tu programa el mismo nombre que un módulo de Python?

source: I suspect that you used the name `{module}.py` for your program and that you also wanted to import a module with the same name from Python's standard library. If so, you should use a different name for your program.
es: Sospecho que has utilizado el nombre `{module}.py` para tu programa y que también querías importar un módulo con el mismo nombre de la biblioteca estándar de Python. Si es así, deberías usar un nombre diferente para tu programa.

source: You have a circular import.
es: Tienes un import circular.

source: You likely have a circular import.
es: Es probable que tengas un import circular.

source: Python indicated that the module `{module}` was not fully imported.
es: Python indicó que el módulo `{module}` no fue importado completamente.

source: This can occur if, during the execution of the code in module `{module}` an attempt is made to import the same module again.
es: Esto puede ocurrir si, durante la ejecución del código del módulo `{module}` se intenta importar de nuevo el mismo módulo.

source: This should not happen: Python tells us that module `{module}` does not have an attribute named `{attribute}`. However, it does not appear that module `{module}` was imported.
es: Esto no debería ocurrir: Python nos dice que el módulo `{module}` no tiene un atributo llamado `{attribute}`. Sin embargo, no parece que el módulo `{module}` haya sido importado.

source: Did you mean `{name}`?
es: ¿Quieres decir `{name}`?

source: Perhaps you meant to write `{module}.{correct}` instead of `{module}.{typo}`
es: Quizás quisiste escribir `{module}.{correct}` en lugar de `{module}.{typo}`

source: Instead of writing `{module}.{typo}`, perhaps you meant to write one of the following names which are attributes of module `{module}`: `{names}`
es: En lugar de escribir `{module}.{typo}`, quizás quisiste escribir uno de los siguientes nombres que son atributos del módulo `{module}`: `{names}`

source: You imported a module named `{module}` from `{mod_path}`. There is also a module named `{module}` in Python's standard library. Perhaps you need to rename your module.
es: Importaste un modulo llamado`{module}` desde `{mod_path}`. Pero también existe un modulo llamado `{module}` en la librería estándar de Python. Quizás debas cambiar el nombre de tu módulo.

source: Perhaps you meant to use the attribute `{attribute}` of module `{mod_name}` instead of module `{module}`.
es: Quizás quisiste utilizar el atributo `{attribute}` del modulo `{mod_name}` en lugar del módulo `{module}`.

source: Did you mean one of the following modules: `{names}`?
es: ¿Querías utilizar uno de los módulos: `{names}`?

source: Instead of the module `{module}`, perhaps you wanted to use the attribute `{attribute}` of one of the following modules: `{names}`.
es: En lugar del modulo `{module}`, quizás querías usar el atributo `{attribute}` de uno de los siguientes módulos: `{names}.

source: Python tells us that no object with name `{attribute}` is found in module `{module}`.
es: Python nos indica que no se encuentra ningún objeto con nombre `{attribute}` en el módulo `{module}`.

source: You are attempting to access the attribute `{attr}` for a variable whose value is `None`.
es: Está intentando acceder al atributo `{attr}` de una variable cuyo valor es `None`.

source: The value of attribute `{attribute}` of objects of type `{obj_type}` cannot be changed. I have no further information.
es: El valor del atributo `{attribute}` en el objeto de tipo `{obj_type}` no puede ser cambiado. No tengo más información.

source: Object `{name}` uses an empty `__slots__` to prevent the modification of any of its attributes.
es: El objeto `{name}` utiliza un `__slots__` vacío para prevenir la modificación de cualquiera de sus atributos.

source: Object `{name}` uses `__slots__` to specify which attributes can be changed. The value of attribute `{name}.{attribute}` cannot be changed.
es: El objeto `{name}` utiliza `__slots__` para indicar que atributos pueden cambiar. Puntualmente, el valor del atributo `{name}.{attribute}` no puede ser cambiado.

source: `{obj_name}` is a function. Perhaps you meant to write `{obj_name}({attribute})`
es: `{obj_name}` es una función. Quizás quisiste escribir `{obj_name}({attribute})`

source: Did you mean `{obj_name}({attribute})`?
es: ¿Querías decir `{obj_name}({attribute})`?

source: `{obj_name}` is a Python built-in function or method which does not have an attribute named `{attribute}.`
es: `{obj_name}` es una función o método integrado de Python el cual no posee un atributo llamado `{attribute}.`

source: An object of type `{obj_type}` has no attribute named `{attr}`. Unfortunately I cannot find such an object on the line where the problem occurs.
es: Un objeto de tipo `{obj_type}` no tiene ningún atributo llamado `{attr}`. Lamentablemente, no puedo encontrar un objeto de este tipo en la línea en la que el problema fue encontrado.

source: An object of type `{obj_type}` has no attribute named `{attr}`. I cannot give additional information: I found one object of this type in the current scope but it does not appear to be the object causing the problem.
es: Un objeto de tipo `{obj_type}` no tiene ningún atributo llamado `{attr}`. No puedo dar información adicional: He encontrado un objeto de este tipo en el ámbito actual pero no parece ser el objeto que causa el problema.

source: An object of type `{obj_type}` has no attribute named `{attr}`. The following objects might be the cause of the problem: {names}.
es: Un objeto de tipo `{obj_type}` no tiene ningún atributo llamado `{attr}`. Los siguientes objetos pueden ser la causa del problema: {names}.

source: The object `{obj}` has no attribute named `{attr}`.
es: Un objeto de tipo `{obj}` no tiene ningún atributo llamado `{attr}`.
