Repository: friendly-traceback/friendly-traceback
Catalog: friendly_traceback/locales/*/LC_MESSAGES/friendly_tb_*.po
Languages: es

source: You tried to define a function and did not use the correct syntax.
es: Has intentado definir una función y no has utilizado la sintaxis correcta.

source: Functions and methods need a name.
es: Las funciones y los métodos necesitan un nombre.

source: You tried to define a function or method and did not use the correct syntax.
es: Has intentado definir una función o un método y no has utilizado la sintaxis correcta.

source: Did you forget parentheses?
es: ¿Has olvidado los paréntesis?

source: Perhaps you forgot to include parentheses. You might have meant to write {line}
es: Tal vez haya olvidado incluir los paréntesis. Puede que hayas querido escribir {line}

source: A function definition statement must end with a colon.
es: Una declaración de definición de función debe terminar con dos puntos.

source: Did you forget to write a colon?
es: ¿Olvidaste escribir dos puntos?

source: You wrote `{bad}` instead of a colon.
es: Has escrito `{bad}` en lugar de dos puntos.

source: Did you write something by mistake after the colon?
es: ¿Escribiste algo por error después de los dos puntos?

source: A block of code must come after the colon.
es: Un bloque de código debe ir después de los dos puntos.

source: Removing `{bad}`, might fix the problem.
es: Eliminar `{bad}`, podría solucionar el problema.

source: You cannot use a Python keyword as a function name.
es: No se puede utilizar una palabra clave de Python como nombre de función.

source: You tried to use the Python keyword `{kwd}` as a function name.
es: Has intentado utilizar la palabra clave de Python `{kwd}` como nombre de función.

source: There are more syntax errors later in your code.
es: Hay errores de sintaxis adicionales más adelante en su código.

source: You wrote an invalid function name.
es: Has escrito un nombre de función no válido.

source: The name of a function must be a valid Python identifier, that is a name that begins with a letter or an underscore character, `_`, and which contains only letters, digits or the underscore character.
es: El nombre de una función debe ser un identificador válido de Python, es decir, un nombre que comience con una letra o un carácter de subrayado, `_`, y que contenga sólo letras, dígitos o el carácter de subrayado.

source: You attempted to use a string as a function name.
es: Has intentado utilizar una cadena como nombre de función.

source: You forgot to name your function.
es: Has olvidado nombrar tu función.

source: However, there are some other syntax errors in your code.
es: Sin embargo, hay algunos errores de sintaxis adicionales en su código.

source: I am guessing that you tried to use the Python keyword `{kwd}` as an argument in the definition of a function where an identifier (variable name) was expected.
es: Supongo que has intentado utilizar la palabra clave de Python `{kwd}` como argumento en la definición de una función donde se esperaba un identificador (nombre de variable).

source: You cannot use dotted names as function arguments.
es: No se pueden utilizar nombres con puntos como argumentos de funciones.

source: Perhaps you meant to write a comma.
es: Tal vez querías escribir una coma.

source: Did you mean to write a comma?
es: ¿Querías escribir una coma?

source: You cannot use dots in function names.
es: No se pueden utilizar puntos en los nombres de las funciones.

source: `/` indicates that the previous arguments in a function definition are positional arguments.
es: `/` indica que los argumentos anteriores en una definición de función son argumentos posicionales.

source: Function definitions cannot include the symbol `/` in this Python version.
es: Las definiciones de funciones no pueden incluir el símbolo `/` en esta versión de Python.

source: This symbol can only be used with Python versions 3.8.0 or newer. You are using Python version {version}.
es: Este símbolo sólo puede utilizarse con las versiones de Python 3.8.0 o posteriores. Está utilizando la versión de Python {version}.

source: You have unspecified keyword arguments that appear before the symbol `/`.
es: Tiene argumentos de palabras clave no especificadas que aparecen antes de el símbolo `/`.

source: Keyword arguments must appear after the `/` symbol.
es: Los argumentos de las palabras clave deben aparecer después del símbolo `/`.

source: However, `*` indicates that the arguments that follow must be keyword arguments. When they are used together, `/` must appear before `*`.
es: Sin embargo, `*` indica que los argumentos que siguen deben ser argumentos de palabra clave. Cuando se utilizan juntos, `/` debe aparecer antes de `*`.

source: `*` must appear after `/` in a function definition.
es: El símbolo `*` debe aparecer después de `/` en la definición de una función.

source: `*{name}` must appear after `/` in a function definition.
es: La palabra `*{name}` debe aparecer después de `/` en la definición de una función.

source: You can only use `/` once in a function definition.
es: Sólo se puede utilizar `/` una vez en la definición de una función.

source: You can only use `*` once in a function definition.
es: Sólo se puede utilizar `*` una vez en la definición de una función.

source: You have used it twice, with `*{first}` and `*{second}`.
es: Lo has utilizado dos veces, con `*{first}` y `*{second}`.

source: It must either be used by itself, `*`, or in the form `*{args}`, but not both.
es: Debe usarse solo, `*`, o en la forma `*{args}`, pero no ambas.

source: `*{args}` must appear before `**{kwargs}`.
es: `*{args}` debe aparecer antes de `**{kwargs}`.

source: `**{kwargs}` must appear after the `*` operator.
es: `**{kwargs}` debe aparecer después del operador `*`.

source: You cannot use numbers as function arguments.
es: No se pueden utilizar números como argumentos de funciones.

source: You used a number as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
es: Ha utilizado un número como argumento al definir una función. Sólo puede utilizar identificadores (nombres de variables) como argumentos de funciones.

source: You cannot use strings as function arguments.
es: No se pueden utilizar cadenas como argumentos de funciones.

source: You used a string as an argument when defining a function. You can only use identifiers (variable names) as function arguments.
es: Ha utilizado una cadena como argumento al definir una función. Sólo se pueden utilizar identificadores (nombres de variables) como argumentos de funciones.

source: You cannot have explicit tuples as function arguments.
es: No se pueden tener tuplas explícitas como argumentos de la función.

source: You can only use identifiers (variable names) as function arguments. Assign any tuple to a parameter and unpack it within the body of the function.
es: Sólo se pueden utilizar identificadores (nombres de variables) como argumentos de funciones. Asignar cualquier tupla a un parámetro y desempaquetarla dentro del cuerpo de la función.

source: You cannot have explicit lists as function arguments.
es: No se pueden tener listas explícitas como argumentos de funciones.

source: You can only use identifiers (variable names) as function arguments.
es: Sólo se pueden utilizar identificadores (nombres de variables) como argumentos de funciones.

source: You cannot have any explicit dict or set as function arguments.
es: No puede tener ningún dict o set explícito como argumentos de la función.

source: You cannot have operators as function arguments.
es: No se pueden tener operadores como argumentos de la función.

source: I suspect you made a typo and wrote `{op}` instead of a comma. The following statement contains no syntax error: {new_statement}
es: Sospecho que has cometido un error tipográfico y has escrito `{op}` en lugar de una coma. La siguiente declaración no contiene ningún error de sintaxis: {new_statement}

source: Did you mean to write an equal sign?
es: ¿Querías escribir un signo de igualdad?

source: I suspect you made a typo and wrote `{op}` instead of an equal sign. The following statement contains no syntax error: {new_statement}
es: Sospecho que has cometido un error tipográfico y has escrito `{op}` en lugar de un signo de igualdad. La siguiente declaración no contiene ningún error de sintaxis: {new_statement}

source: Did you mean to write `{op}`?
es: ¿Querías escribir `{op}`?

source: I suspect you made a typo and added `{op}` by mistake. The following statement contains no syntax error: {new_statement}
es: Sospecho que has cometido un error tipográfico y has añadido `{op}` por error. La siguiente declaración no contiene ningún error de sintaxis: {new_statement}

source: You cannot use `{op}` as an argument.
es: No se puede utilizar `{op}` como argumento.

source: I suspect you made a typo and wrote `{op}` by mistake. If you replace it by a unique variable name, the result will contain no syntax error.
es: Sospecho que has cometido una errata y has escrito `{op}` por error. Si lo sustituye por un nombre de variable único, el resultado no contendrá ningún error de sintaxis.

source: I suspect you made a typo and wrote `{op}` by mistake, perhaps instead of writing an identifier (variable name).
es: Sospecho que has cometido una errata y has escrito `{op}` por error, tal vez en lugar de escribir un identificador (nombre de la variable).

source: The `**` operator needs to be followed by an identifier (variable name).
es: El operador `**` debe ir seguido de un identificador (nombre de la variable).

source: Positional arguments must come before keyword arguments.
es: Los argumentos posicionales deben ir antes de los argumentos de palabra clave.

source: `{arg}` is a positional argument that appears after one or more keyword arguments in your function definition.
es: `{arg}` es un argumento posicional que aparece después de uno o más argumentos de la palabra clave en la definición de la función.

source: Line `{number}` identified above is more indented than expected.
es: La línea `{number}` identificada arriba tiene más indentación de la esperada.

source: Line `{number}` identified above was expected to begin a new indented block.
es: Se esperaba que la línea `{number}` identificada anteriormente comenzara un nuevo bloque indentado.

source: Line `{number}` identified above is less indented than expected.
es: La línea `{number}` identificada arriba tiene menos indentación de la esperada.

source: However, line {number}, which is identified as having a problem, consists of a single string which is also the case for the preceding line. Perhaps you meant to include a continuation character, `\`, at the end of line {preceding}.
es: Sin embargo, la línea {number}, que se identifica como consiste en una sola cadena, lo que también ocurre de la línea anterior. Tal vez haya querido incluir un carácter de continuación, ``, al final de la línea {preceding}.

source: You can only assign objects to identifiers (variable names).
es: Sólo se pueden asignar objetos a identificadores (nombres de variables).

source: You can only delete names of objects, or items in mutable containers such as `list`, `set`, or `dict`.
es: Sólo se pueden borrar nombres de objetos, o elementos en contenedores mutables como `list`, `set` o `dict`.

source: of type `int`
es: de tipo `int`

source: of type `complex`
es: de tipo `complex`

source: of type `float`
es: de tipo `float`

source: of type `str`
es: de tipo `str`

source: of type `dict`
es: de tipo `dict`

source: of type `list`
es: de tipo `list`

source: of type `set`
es: de tipo `set`

source: of type `tuple`
es: de tipo `tuple`

source: Did you mean `{num}`?
es: ¿Querías decir `{num}`?

source: Perhaps you meant to write the octal number `{num}` and forgot the letter 'o', or perhaps you meant to write a decimal integer and did not know that it could not start with zeros.
es: Tal vez querías escribir el número octal `{num}` y se olvidó de la letra 'o', o tal vez quería escribir un número entero decimal y no sabía que no podía empezar con ceros.

source: Perhaps you meant to write the integer `{num}` and did not know that it could not start with zeros.
es: Tal vez usted quiso escribir el número entero `{num}` y no sabía que no podía empezar con ceros.

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. A conditional expression has the following form: variable = object if condition else other_object
es: En el lado izquierdo de un signo igual, tiene una expresión condicional en lugar del nombre de una variable. Una expresión condicional tiene la siguiente forma: variable = objeto if condición else otro_objeto

source: On the left-hand side of an equal sign, you have a conditional expression instead of the name of a variable. {expression} = ... {mark}
es: En el lado izquierdo de un signo igual, tiene una expresión generadora en lugar del nombre de una variable. {expression} = ... {mark}

source: On the left-hand side of an equal sign, you have an expression instead of the name of a variable.
es: En el lado izquierdo de un signo igual, tiene una expresión en lugar del nombre de una variable.

source: You wrote the expression {fn_call} = ... where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
es: Has escrito una expresión como {fn_call} = ... donde `{fn_call}`, a la izquierda del signo igual, es o incluye una llamada a una función y no es simplemente el nombre de una variable.

source: You wrote the expression {fn_call} = ... {mark} where `{fn_call}`, on the left-hand side of the equal sign, either is or includes a function call and is not simply the name of a variable.
es: Has escrito una expresión como {fn_call} = ... {mark} donde `{fn_call}`, a la izquierda del signo igual, es o incluye una llamada a una función y no es simplemente el nombre de una variable.

source: On the left-hand side of an equal sign, you have a generator expression instead of the name of a variable.
es: En el lado izquierdo de un signo igual, tiene una expresión generadora en lugar del nombre de una variable.

source: You wrote an expression that has the f-string `{fstring}` on the left-hand side of the equal sign. An f-string should only appear on the right-hand side of an equal sign.
es: Has escrito una expresión que tiene la f-string `{fstring}`` en el lado izquierdo del signo igual en el lado izquierdo del signo igual. Una f-string sólo debe aparecer en el lado derecho de un signo igual.

source: You cannot assign a value to `{keyword}`.
es: No se puede asignar un valor a `{keyword}`.

source: You cannot assign a value to the ellipsis symbol [`...`].
es: No se puede asignar un valor al símbolo de elipsis [`...`].

source: The ellipsis symbol `...` is a constant in Python;you cannot assign it a different value.
es: El símbolo de la elipsis `...` es una constante en Python; no se le puede asignar un valor diferente.

source: `{keyword}` is a constant in Python; you cannot assign it a different value.
es: {keyword}` es una constante en Python; no puedes asignarle un valor diferente.

source: You were trying to assign a value to the Python keyword `{keyword}`. This is not allowed.
es: Has intentado asignar un valor a la palabra clave de Python `{keyword}`. Esto no está permitido.

source: A for loop must have the form: for ... in sequence: where `...` must contain only identifiers (variable names) and not literals like `{bad_token}`.
es: Un bucle for debe tener la forma for ... in secuencia: donde `...` debe contener sólo identificadores (nombres de variables) y no literales como `{bad_token}`.

source: variable_name
es: nombre_de_variable

source: Perhaps you meant to write: {name} = {literal}
es: Tal vez querías escribir: {name} = {literal}

source: Perhaps you meant to write `{name} = {literal}`
es: Tal vez querías escribir `{name} = {literal}`

source: You wrote an expression like {literal} = {name} where `{literal}`, on the left-hand side of the equal sign, is or includes an actual object {of_type} and is not simply the name of a variable.
es: Has escrito una expresión como {literal} = {name} donde `{literal}`, a la izquierda del signo de igualdad es o incluye un objeto real {of_type} y no es simplemente el nombre de una variable.

source: It is possible that you used an equal sign `=` instead of a colon `:` to assign values to keys in a dict.
es: Es posible que haya utilizado un signo igual `=` en lugar de dos puntos `:` para asignar valores a las claves de un dict.

source: You wrote an expression that includes some mathematical operations on the left-hand side of the equal sign which should be only used to assign a value to a variable.
es: Has escrito una expresión que incluye algunas operaciones matemáticas en el lado izquierdo del signo igual que debería ser sólo utilizarse para asignar un valor a una variable.

source: Perhaps you meant to write `{name}` instead of `{original}`
es: Tal vez quiso escribir `{name}` en lugar de `{original}`.

source: Perhaps you needed `==` instead of `=`.
es: Tal vez necesitabas `==` en lugar de `=`.

source: You wrote an expression that includes the `yield` keyword on the left-hand side of the equal sign. You cannot assign a value to such an expression. Note that, like the keyword `return`, `yield` can only be used inside a function.
es: Ha escrito una expresión que incluye la palabra clave `yield a la izquierda del signo igual. No se puede asignar un valor a una expresión de este tipo. Tenga en cuenta que, al igual que la palabra clave `return`, `yield` sólo puede usarse dentro de una función.

source: You are using the augmented assignment operator `:=` inside a comprehension to assign a value to the iteration variable `{var}`. This variable is meant to be used only inside the comprehension. The augmented assignment operator is normally used to assign a value to a variable so that the variable can be reused later. This is not possible for variable `{var}`.
es: Está utilizando el operador de asignación aumentada `:=` dentro de una comprensión para asignar un valor a la variable de iteración `{var}`. Esta variable está pensada para ser empleada sólo dentro de la comprensión. El operador de asignación aumentada se usa normalmente para asignar un valor a una variable para poder reutilizarla posteriormente. Esto no es posible para la variable `{var}`.

source: The object named `{name}` is defined with type annotation as a local variable. It cannot be declared to be a global variable.
es: El objeto llamado `{name}` se define con la anotación de tipo como una variable local. No se puede declarar como una variable global.

source: You cannot use the augmented assignment operator `:=`, sometimes called the walrus operator, with literals like `{bad_token}`. You can only assign objects to identifiers (variable names).
es: No se puede utilizar el operador de asignación aumentada `:=`, a veces llamado operador morsa, con literales como `{bad_token}`. Sólo se pueden asignar objetos a identificadores (nombres de variables).

source: You declared `{name}` as being both a global and nonlocal variable. A variable can be global, or nonlocal, but not both at the same time.
es: Has declarado que {name}` es una variable global y no local. Una variable puede ser global o no local, pero no ambas cosas a la vez.

source: Python tells us that the {bracket} was never closed.
es: Python nos dice que el {bracket} nunca fue cerrado.

source: The {bracket} was never closed.
es: El {bracket} nunca fue cerrado.

source: The Python keyword `break` can only be used inside a `for` loop or inside a `while` loop.
es: La palabra clave de Python `break` sólo puede utilizarse dentro de un bucle `for` o dentro de un bucle `while`.

source: You likely used an assignment operator `=` instead of an equality operator `==`.
es: Es probable que hayas utilizado un operador de asignación `=` en lugar de un operador de igualdad `==`.

source: The following statement would not contain a syntax error: {new_statement}
es: La siguiente sentencia no contendría un error de sintaxis: {new_statement}

source: You cannot delete the constant `{constant}`.
es: No se puede eliminar la constante `{constant}`.

source: You cannot delete a Python expression.
es: No se puede borrar una expresión de Python.

source: You cannot delete the expression `{expression}`.
es: No se puede eliminar la expresión `{expression}`.

source: You attempted to delete a function call {line} instead of deleting the function's name {correct}
es: Has intentado borrar una llamada a una función {line} en lugar de borrar el nombre de la función {correct}

source: You cannot delete the literal `{literal}`.
es: No se puede eliminar el literal `{literal}`.

source: You cannot delete the named expression `{expression}`.
es: No se puede eliminar la expresión con nombre `{expression}`.

source: The star operator `*` is interpreted to mean that iterable unpacking is to be used to assign a name to each item of an iterable, which does not make sense here.
es: El operador estrella `*` se interpreta como que el desempaquetado de un iterable debe ser usado para asignar un nombre a cada elemento de un iterable, lo que no tiene sentido aquí.

source: It looks like you surrounded a starred name by parentheses. This was not considered a SyntaxError before Python version 3.9.
es: Parece que has rodeado un nombre con asteriscos con paréntesis. Esto no se consideraba un SyntaxError antes de la versión 3.9 de Python.

source: Did you forget a colon?
es: ¿Olvidaste los dos puntos?

source: Python expected a colon at the position indicated.
es: Python esperaba dos puntos en la posición indicada.

source: It looks like the error occurred as you were writing a Python dict. Perhaps you wrote a dict key without writing the corresponding value.
es: Parece que el error se produjo mientras escribías un dict de Python. Quizás escribiste una clave de dict sin escribir el valor correspondiente.

source: Did you forget to write a dict value?
es: ¿Olvidaste escribir el valor del dict?

source: The Python keyword `continue` can only be used inside a `for` loop or inside a `while` loop.
es: La palabra clave de Python `continue` sólo puede usarse dentro de un bucle `for` o dentro de un bucle `while`.

source: You have defined a function repeating the argument {name} Each argument should appear only once in a function definition.
es: Ha definido una función que repite el argumento {name} Cada argumento debe aparecer sólo una vez en la definición de una función.

source: Did you forget to add `else`?
es: ¿Olvidaste añadir `else`?

source: An `else some_value` clause was expected after the `if` expression.
es: Se esperaba una cláusula `else algún_valor` después de la expresión `if`.

source: You started writing a triple-quoted string but never wrote the triple quotes needed to end the string.
es: Empezó a escribir una cadena con comillas triples pero nunca escribió las comillas triples necesarias para terminar la cadena.

source: Did you forget a closing quote?
es: ¿Olvidaste la comilla de cierre?

source: You started writing a string with a single or double quote but never ended the string with another quote on that line.
es: Ha empezado a escribir una cadena con una comilla simple o doble pero nunca terminó la cadena con otra comilla en esa línea.

source: Perhaps you meant to write the backslash character, `\` as the last character in the string and forgot that you needed to escape it by writing two `\` in a row.
es: Tal vez quiso escribir el carácter de la barra diagonal inversa, `\` como el último carácter de la cadena y se olvidó de que que necesitaba escapar escribiendo dos `\` seguidas.

source: Did you forget to escape a backslash character?
es: ¿Olvidaste escapar un carácter de barra invertida?
